FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4200.h
/* --------------------------------  HRPWM0_GLBANA  ------------------------------- */
#define HRPWM0_GLBANA_SLDLY_Pos               0                                                       /*!< HRPWM0 GLBANA: SLDLY Position           */
#define HRPWM0_GLBANA_SLDLY_Msk               (0x03UL << HRPWM0_GLBANA_SLDLY_Pos)                     /*!< HRPWM0 GLBANA: SLDLY Mask               */
#define HRPWM0_GLBANA_FUP_Pos                 2                                                       /*!< HRPWM0 GLBANA: FUP Position             */
#define HRPWM0_GLBANA_FUP_Msk                 (0x01UL << HRPWM0_GLBANA_FUP_Pos)                       /*!< HRPWM0 GLBANA: FUP Mask                 */
#define HRPWM0_GLBANA_FDN_Pos                 3                                                       /*!< HRPWM0 GLBANA: FDN Position             */
#define HRPWM0_GLBANA_FDN_Msk                 (0x01UL << HRPWM0_GLBANA_FDN_Pos)                       /*!< HRPWM0 GLBANA: FDN Mask                 */
#define HRPWM0_GLBANA_SLCP_Pos                6                                                       /*!< HRPWM0 GLBANA: SLCP Position            */
#define HRPWM0_GLBANA_SLCP_Msk                (0x07UL << HRPWM0_GLBANA_SLCP_Pos)                      /*!< HRPWM0 GLBANA: SLCP Mask                */
#define HRPWM0_GLBANA_SLIBLDO_Pos             9                                                       /*!< HRPWM0 GLBANA: SLIBLDO Position         */
#define HRPWM0_GLBANA_SLIBLDO_Msk             (0x03UL << HRPWM0_GLBANA_SLIBLDO_Pos)                   /*!< HRPWM0 GLBANA: SLIBLDO Mask             */
#define HRPWM0_GLBANA_SLIBLF_Pos              11                                                      /*!< HRPWM0 GLBANA: SLIBLF Position          */
#define HRPWM0_GLBANA_SLIBLF_Msk              (0x03UL << HRPWM0_GLBANA_SLIBLF_Pos)                    /*!< HRPWM0 GLBANA: SLIBLF Mask              */
#define HRPWM0_GLBANA_SLVREF_Pos              13                                                      /*!< HRPWM0 GLBANA: SLVREF Position          */
#define HRPWM0_GLBANA_SLVREF_Msk              (0x07UL << HRPWM0_GLBANA_SLVREF_Pos)                    /*!< HRPWM0 GLBANA: SLVREF Mask              */
#define HRPWM0_GLBANA_TRIBIAS_Pos             16                                                      /*!< HRPWM0 GLBANA: TRIBIAS Position         */
#define HRPWM0_GLBANA_TRIBIAS_Msk             (0x03UL << HRPWM0_GLBANA_TRIBIAS_Pos)                   /*!< HRPWM0 GLBANA: TRIBIAS Mask             */
#define HRPWM0_GLBANA_GHREN_Pos               18                                                      /*!< HRPWM0 GLBANA: GHREN Position           */
#define HRPWM0_GLBANA_GHREN_Msk               (0x01UL << HRPWM0_GLBANA_GHREN_Pos)                     /*!< HRPWM0 GLBANA: GHREN Mask               */

/* --------------------------------  HRPWM0_CSGCFG  ------------------------------- */
#define HRPWM0_CSGCFG_C0PM_Pos                0                                                       /*!< HRPWM0 CSGCFG: C0PM Position            */
#define HRPWM0_CSGCFG_C0PM_Msk                (0x03UL << HRPWM0_CSGCFG_C0PM_Pos)                      /*!< HRPWM0 CSGCFG: C0PM Mask                */
#define HRPWM0_CSGCFG_C1PM_Pos                2                                                       /*!< HRPWM0 CSGCFG: C1PM Position            */
#define HRPWM0_CSGCFG_C1PM_Msk                (0x03UL << HRPWM0_CSGCFG_C1PM_Pos)                      /*!< HRPWM0 CSGCFG: C1PM Mask                */
#define HRPWM0_CSGCFG_C2PM_Pos                4                                                       /*!< HRPWM0 CSGCFG: C2PM Position            */
#define HRPWM0_CSGCFG_C2PM_Msk                (0x03UL << HRPWM0_CSGCFG_C2PM_Pos)                      /*!< HRPWM0 CSGCFG: C2PM Mask                */
#define HRPWM0_CSGCFG_C0CD_Pos                16                                                      /*!< HRPWM0 CSGCFG: C0CD Position            */
#define HRPWM0_CSGCFG_C0CD_Msk                (0x01UL << HRPWM0_CSGCFG_C0CD_Pos)                      /*!< HRPWM0 CSGCFG: C0CD Mask                */
#define HRPWM0_CSGCFG_C1CD_Pos                17                                                      /*!< HRPWM0 CSGCFG: C1CD Position            */
#define HRPWM0_CSGCFG_C1CD_Msk                (0x01UL << HRPWM0_CSGCFG_C1CD_Pos)                      /*!< HRPWM0 CSGCFG: C1CD Mask                */
#define HRPWM0_CSGCFG_C2CD_Pos                18                                                      /*!< HRPWM0 CSGCFG: C2CD Position            */
#define HRPWM0_CSGCFG_C2CD_Msk                (0x01UL << HRPWM0_CSGCFG_C2CD_Pos)                      /*!< HRPWM0 CSGCFG: C2CD Mask                */

/* -------------------------------  HRPWM0_CSGSETG  ------------------------------- */
#define HRPWM0_CSGSETG_SD0R_Pos               0                                                       /*!< HRPWM0 CSGSETG: SD0R Position           */
#define HRPWM0_CSGSETG_SD0R_Msk               (0x01UL << HRPWM0_CSGSETG_SD0R_Pos)                     /*!< HRPWM0 CSGSETG: SD0R Mask               */
#define HRPWM0_CSGSETG_SC0R_Pos               1                                                       /*!< HRPWM0 CSGSETG: SC0R Position           */
#define HRPWM0_CSGSETG_SC0R_Msk               (0x01UL << HRPWM0_CSGSETG_SC0R_Pos)                     /*!< HRPWM0 CSGSETG: SC0R Mask               */
#define HRPWM0_CSGSETG_SC0P_Pos               2                                                       /*!< HRPWM0 CSGSETG: SC0P Position           */
#define HRPWM0_CSGSETG_SC0P_Msk               (0x01UL << HRPWM0_CSGSETG_SC0P_Pos)                     /*!< HRPWM0 CSGSETG: SC0P Mask               */
#define HRPWM0_CSGSETG_SD1R_Pos               4                                                       /*!< HRPWM0 CSGSETG: SD1R Position           */
#define HRPWM0_CSGSETG_SD1R_Msk               (0x01UL << HRPWM0_CSGSETG_SD1R_Pos)                     /*!< HRPWM0 CSGSETG: SD1R Mask               */
#define HRPWM0_CSGSETG_SC1R_Pos               5                                                       /*!< HRPWM0 CSGSETG: SC1R Position           */
#define HRPWM0_CSGSETG_SC1R_Msk               (0x01UL << HRPWM0_CSGSETG_SC1R_Pos)                     /*!< HRPWM0 CSGSETG: SC1R Mask               */
#define HRPWM0_CSGSETG_SC1P_Pos               6                                                       /*!< HRPWM0 CSGSETG: SC1P Position           */
#define HRPWM0_CSGSETG_SC1P_Msk               (0x01UL << HRPWM0_CSGSETG_SC1P_Pos)                     /*!< HRPWM0 CSGSETG: SC1P Mask               */
#define HRPWM0_CSGSETG_SD2R_Pos               8                                                       /*!< HRPWM0 CSGSETG: SD2R Position           */
#define HRPWM0_CSGSETG_SD2R_Msk               (0x01UL << HRPWM0_CSGSETG_SD2R_Pos)                     /*!< HRPWM0 CSGSETG: SD2R Mask               */
#define HRPWM0_CSGSETG_SC2R_Pos               9                                                       /*!< HRPWM0 CSGSETG: SC2R Position           */
#define HRPWM0_CSGSETG_SC2R_Msk               (0x01UL << HRPWM0_CSGSETG_SC2R_Pos)                     /*!< HRPWM0 CSGSETG: SC2R Mask               */
#define HRPWM0_CSGSETG_SC2P_Pos               10                                                      /*!< HRPWM0 CSGSETG: SC2P Position           */
#define HRPWM0_CSGSETG_SC2P_Msk               (0x01UL << HRPWM0_CSGSETG_SC2P_Pos)                     /*!< HRPWM0 CSGSETG: SC2P Mask               */

/* -------------------------------  HRPWM0_CSGCLRG  ------------------------------- */
#define HRPWM0_CSGCLRG_CD0R_Pos               0                                                       /*!< HRPWM0 CSGCLRG: CD0R Position           */
#define HRPWM0_CSGCLRG_CD0R_Msk               (0x01UL << HRPWM0_CSGCLRG_CD0R_Pos)                     /*!< HRPWM0 CSGCLRG: CD0R Mask               */
#define HRPWM0_CSGCLRG_CC0R_Pos               1                                                       /*!< HRPWM0 CSGCLRG: CC0R Position           */
#define HRPWM0_CSGCLRG_CC0R_Msk               (0x01UL << HRPWM0_CSGCLRG_CC0R_Pos)                     /*!< HRPWM0 CSGCLRG: CC0R Mask               */
#define HRPWM0_CSGCLRG_CC0P_Pos               2                                                       /*!< HRPWM0 CSGCLRG: CC0P Position           */
#define HRPWM0_CSGCLRG_CC0P_Msk               (0x01UL << HRPWM0_CSGCLRG_CC0P_Pos)                     /*!< HRPWM0 CSGCLRG: CC0P Mask               */
#define HRPWM0_CSGCLRG_CD1R_Pos               4                                                       /*!< HRPWM0 CSGCLRG: CD1R Position           */
#define HRPWM0_CSGCLRG_CD1R_Msk               (0x01UL << HRPWM0_CSGCLRG_CD1R_Pos)                     /*!< HRPWM0 CSGCLRG: CD1R Mask               */
#define HRPWM0_CSGCLRG_CC1R_Pos               5                                                       /*!< HRPWM0 CSGCLRG: CC1R Position           */
#define HRPWM0_CSGCLRG_CC1R_Msk               (0x01UL << HRPWM0_CSGCLRG_CC1R_Pos)                     /*!< HRPWM0 CSGCLRG: CC1R Mask               */
#define HRPWM0_CSGCLRG_CC1P_Pos               6                                                       /*!< HRPWM0 CSGCLRG: CC1P Position           */
#define HRPWM0_CSGCLRG_CC1P_Msk               (0x01UL << HRPWM0_CSGCLRG_CC1P_Pos)                     /*!< HRPWM0 CSGCLRG: CC1P Mask               */
#define HRPWM0_CSGCLRG_CD2R_Pos               8                                                       /*!< HRPWM0 CSGCLRG: CD2R Position           */
#define HRPWM0_CSGCLRG_CD2R_Msk               (0x01UL << HRPWM0_CSGCLRG_CD2R_Pos)                     /*!< HRPWM0 CSGCLRG: CD2R Mask               */
#define HRPWM0_CSGCLRG_CC2R_Pos               9                                                       /*!< HRPWM0 CSGCLRG: CC2R Position           */
#define HRPWM0_CSGCLRG_CC2R_Msk               (0x01UL << HRPWM0_CSGCLRG_CC2R_Pos)                     /*!< HRPWM0 CSGCLRG: CC2R Mask               */
#define HRPWM0_CSGCLRG_CC2P_Pos               10                                                      /*!< HRPWM0 CSGCLRG: CC2P Position           */
#define HRPWM0_CSGCLRG_CC2P_Msk               (0x01UL << HRPWM0_CSGCLRG_CC2P_Pos)                     /*!< HRPWM0 CSGCLRG: CC2P Mask               */

/* -------------------------------  HRPWM0_CSGSTATG  ------------------------------ */
#define HRPWM0_CSGSTATG_D0RB_Pos              0                                                       /*!< HRPWM0 CSGSTATG: D0RB Position          */
#define HRPWM0_CSGSTATG_D0RB_Msk              (0x01UL << HRPWM0_CSGSTATG_D0RB_Pos)                    /*!< HRPWM0 CSGSTATG: D0RB Mask              */
#define HRPWM0_CSGSTATG_C0RB_Pos              1                                                       /*!< HRPWM0 CSGSTATG: C0RB Position          */
#define HRPWM0_CSGSTATG_C0RB_Msk              (0x01UL << HRPWM0_CSGSTATG_C0RB_Pos)                    /*!< HRPWM0 CSGSTATG: C0RB Mask              */
#define HRPWM0_CSGSTATG_PSLS0_Pos             2                                                       /*!< HRPWM0 CSGSTATG: PSLS0 Position         */
#define HRPWM0_CSGSTATG_PSLS0_Msk             (0x01UL << HRPWM0_CSGSTATG_PSLS0_Pos)                   /*!< HRPWM0 CSGSTATG: PSLS0 Mask             */
#define HRPWM0_CSGSTATG_D1RB_Pos              4                                                       /*!< HRPWM0 CSGSTATG: D1RB Position          */
#define HRPWM0_CSGSTATG_D1RB_Msk              (0x01UL << HRPWM0_CSGSTATG_D1RB_Pos)                    /*!< HRPWM0 CSGSTATG: D1RB Mask              */
#define HRPWM0_CSGSTATG_C1RB_Pos              5                                                       /*!< HRPWM0 CSGSTATG: C1RB Position          */
#define HRPWM0_CSGSTATG_C1RB_Msk              (0x01UL << HRPWM0_CSGSTATG_C1RB_Pos)                    /*!< HRPWM0 CSGSTATG: C1RB Mask              */
#define HRPWM0_CSGSTATG_PSLS1_Pos             6                                                       /*!< HRPWM0 CSGSTATG: PSLS1 Position         */
#define HRPWM0_CSGSTATG_PSLS1_Msk             (0x01UL << HRPWM0_CSGSTATG_PSLS1_Pos)                   /*!< HRPWM0 CSGSTATG: PSLS1 Mask             */
#define HRPWM0_CSGSTATG_D2RB_Pos              8                                                       /*!< HRPWM0 CSGSTATG: D2RB Position          */
#define HRPWM0_CSGSTATG_D2RB_Msk              (0x01UL << HRPWM0_CSGSTATG_D2RB_Pos)                    /*!< HRPWM0 CSGSTATG: D2RB Mask              */
#define HRPWM0_CSGSTATG_C2RB_Pos              9                                                       /*!< HRPWM0 CSGSTATG: C2RB Position          */
#define HRPWM0_CSGSTATG_C2RB_Msk              (0x01UL << HRPWM0_CSGSTATG_C2RB_Pos)                    /*!< HRPWM0 CSGSTATG: C2RB Mask              */
#define HRPWM0_CSGSTATG_PSLS2_Pos             10                                                      /*!< HRPWM0 CSGSTATG: PSLS2 Position         */
#define HRPWM0_CSGSTATG_PSLS2_Msk             (0x01UL << HRPWM0_CSGSTATG_PSLS2_Pos)                   /*!< HRPWM0 CSGSTATG: PSLS2 Mask             */

/* --------------------------------  HRPWM0_CSGFCG  ------------------------------- */
#define HRPWM0_CSGFCG_S0STR_Pos               0                                                       /*!< HRPWM0 CSGFCG: S0STR Position           */
#define HRPWM0_CSGFCG_S0STR_Msk               (0x01UL << HRPWM0_CSGFCG_S0STR_Pos)                     /*!< HRPWM0 CSGFCG: S0STR Mask               */
#define HRPWM0_CSGFCG_S0STP_Pos               1                                                       /*!< HRPWM0 CSGFCG: S0STP Position           */
#define HRPWM0_CSGFCG_S0STP_Msk               (0x01UL << HRPWM0_CSGFCG_S0STP_Pos)                     /*!< HRPWM0 CSGFCG: S0STP Mask               */
#define HRPWM0_CSGFCG_PS0STR_Pos              2                                                       /*!< HRPWM0 CSGFCG: PS0STR Position          */
#define HRPWM0_CSGFCG_PS0STR_Msk              (0x01UL << HRPWM0_CSGFCG_PS0STR_Pos)                    /*!< HRPWM0 CSGFCG: PS0STR Mask              */
#define HRPWM0_CSGFCG_PS0STP_Pos              3                                                       /*!< HRPWM0 CSGFCG: PS0STP Position          */
#define HRPWM0_CSGFCG_PS0STP_Msk              (0x01UL << HRPWM0_CSGFCG_PS0STP_Pos)                    /*!< HRPWM0 CSGFCG: PS0STP Mask              */
#define HRPWM0_CSGFCG_PS0CLR_Pos              4                                                       /*!< HRPWM0 CSGFCG: PS0CLR Position          */
#define HRPWM0_CSGFCG_PS0CLR_Msk              (0x01UL << HRPWM0_CSGFCG_PS0CLR_Pos)                    /*!< HRPWM0 CSGFCG: PS0CLR Mask              */
#define HRPWM0_CSGFCG_S1STR_Pos               8                                                       /*!< HRPWM0 CSGFCG: S1STR Position           */
#define HRPWM0_CSGFCG_S1STR_Msk               (0x01UL << HRPWM0_CSGFCG_S1STR_Pos)                     /*!< HRPWM0 CSGFCG: S1STR Mask               */
#define HRPWM0_CSGFCG_S1STP_Pos               9                                                       /*!< HRPWM0 CSGFCG: S1STP Position           */
#define HRPWM0_CSGFCG_S1STP_Msk               (0x01UL << HRPWM0_CSGFCG_S1STP_Pos)                     /*!< HRPWM0 CSGFCG: S1STP Mask               */
#define HRPWM0_CSGFCG_PS1STR_Pos              10                                                      /*!< HRPWM0 CSGFCG: PS1STR Position          */
#define HRPWM0_CSGFCG_PS1STR_Msk              (0x01UL << HRPWM0_CSGFCG_PS1STR_Pos)                    /*!< HRPWM0 CSGFCG: PS1STR Mask              */
#define HRPWM0_CSGFCG_PS1STP_Pos              11                                                      /*!< HRPWM0 CSGFCG: PS1STP Position          */
#define HRPWM0_CSGFCG_PS1STP_Msk              (0x01UL << HRPWM0_CSGFCG_PS1STP_Pos)                    /*!< HRPWM0 CSGFCG: PS1STP Mask              */
#define HRPWM0_CSGFCG_PS1CLR_Pos              12                                                      /*!< HRPWM0 CSGFCG: PS1CLR Position          */
#define HRPWM0_CSGFCG_PS1CLR_Msk              (0x01UL << HRPWM0_CSGFCG_PS1CLR_Pos)                    /*!< HRPWM0 CSGFCG: PS1CLR Mask              */
#define HRPWM0_CSGFCG_S2STR_Pos               16                                                      /*!< HRPWM0 CSGFCG: S2STR Position           */
#define HRPWM0_CSGFCG_S2STR_Msk               (0x01UL << HRPWM0_CSGFCG_S2STR_Pos)                     /*!< HRPWM0 CSGFCG: S2STR Mask               */
#define HRPWM0_CSGFCG_S2STP_Pos               17                                                      /*!< HRPWM0 CSGFCG: S2STP Position           */
#define HRPWM0_CSGFCG_S2STP_Msk               (0x01UL << HRPWM0_CSGFCG_S2STP_Pos)                     /*!< HRPWM0 CSGFCG: S2STP Mask               */
#define HRPWM0_CSGFCG_PS2STR_Pos              18                                                      /*!< HRPWM0 CSGFCG: PS2STR Position          */
#define HRPWM0_CSGFCG_PS2STR_Msk              (0x01UL << HRPWM0_CSGFCG_PS2STR_Pos)                    /*!< HRPWM0 CSGFCG: PS2STR Mask              */
#define HRPWM0_CSGFCG_PS2STP_Pos              19                                                      /*!< HRPWM0 CSGFCG: PS2STP Position          */
#define HRPWM0_CSGFCG_PS2STP_Msk              (0x01UL << HRPWM0_CSGFCG_PS2STP_Pos)                    /*!< HRPWM0 CSGFCG: PS2STP Mask              */
#define HRPWM0_CSGFCG_PS2CLR_Pos              20                                                      /*!< HRPWM0 CSGFCG: PS2CLR Position          */
#define HRPWM0_CSGFCG_PS2CLR_Msk              (0x01UL << HRPWM0_CSGFCG_PS2CLR_Pos)                    /*!< HRPWM0 CSGFCG: PS2CLR Mask              */

/* --------------------------------  HRPWM0_CSGFSG  ------------------------------- */
#define HRPWM0_CSGFSG_S0RB_Pos                0                                                       /*!< HRPWM0 CSGFSG: S0RB Position            */
#define HRPWM0_CSGFSG_S0RB_Msk                (0x01UL << HRPWM0_CSGFSG_S0RB_Pos)                      /*!< HRPWM0 CSGFSG: S0RB Mask                */
#define HRPWM0_CSGFSG_P0RB_Pos                1                                                       /*!< HRPWM0 CSGFSG: P0RB Position            */
#define HRPWM0_CSGFSG_P0RB_Msk                (0x01UL << HRPWM0_CSGFSG_P0RB_Pos)                      /*!< HRPWM0 CSGFSG: P0RB Mask                */
#define HRPWM0_CSGFSG_S1RB_Pos                8                                                       /*!< HRPWM0 CSGFSG: S1RB Position            */
#define HRPWM0_CSGFSG_S1RB_Msk                (0x01UL << HRPWM0_CSGFSG_S1RB_Pos)                      /*!< HRPWM0 CSGFSG: S1RB Mask                */
#define HRPWM0_CSGFSG_P1RB_Pos                9                                                       /*!< HRPWM0 CSGFSG: P1RB Position            */
#define HRPWM0_CSGFSG_P1RB_Msk                (0x01UL << HRPWM0_CSGFSG_P1RB_Pos)                      /*!< HRPWM0 CSGFSG: P1RB Mask                */
#define HRPWM0_CSGFSG_S2RB_Pos                16                                                      /*!< HRPWM0 CSGFSG: S2RB Position            */
#define HRPWM0_CSGFSG_S2RB_Msk                (0x01UL << HRPWM0_CSGFSG_S2RB_Pos)                      /*!< HRPWM0 CSGFSG: S2RB Mask                */
#define HRPWM0_CSGFSG_P2RB_Pos                17                                                      /*!< HRPWM0 CSGFSG: P2RB Position            */
#define HRPWM0_CSGFSG_P2RB_Msk                (0x01UL << HRPWM0_CSGFSG_P2RB_Pos)                      /*!< HRPWM0 CSGFSG: P2RB Mask                */

/* --------------------------------  HRPWM0_CSGTRG  ------------------------------- */
#define HRPWM0_CSGTRG_D0SES_Pos               0                                                       /*!< HRPWM0 CSGTRG: D0SES Position           */
#define HRPWM0_CSGTRG_D0SES_Msk               (0x01UL << HRPWM0_CSGTRG_D0SES_Pos)                     /*!< HRPWM0 CSGTRG: D0SES Mask               */
#define HRPWM0_CSGTRG_D0SVS_Pos               1                                                       /*!< HRPWM0 CSGTRG: D0SVS Position           */
#define HRPWM0_CSGTRG_D0SVS_Msk               (0x01UL << HRPWM0_CSGTRG_D0SVS_Pos)                     /*!< HRPWM0 CSGTRG: D0SVS Mask               */
#define HRPWM0_CSGTRG_D1SES_Pos               4                                                       /*!< HRPWM0 CSGTRG: D1SES Position           */
#define HRPWM0_CSGTRG_D1SES_Msk               (0x01UL << HRPWM0_CSGTRG_D1SES_Pos)                     /*!< HRPWM0 CSGTRG: D1SES Mask               */
#define HRPWM0_CSGTRG_D1SVS_Pos               5                                                       /*!< HRPWM0 CSGTRG: D1SVS Position           */
#define HRPWM0_CSGTRG_D1SVS_Msk               (0x01UL << HRPWM0_CSGTRG_D1SVS_Pos)                     /*!< HRPWM0 CSGTRG: D1SVS Mask               */
#define HRPWM0_CSGTRG_D2SES_Pos               8                                                       /*!< HRPWM0 CSGTRG: D2SES Position           */
#define HRPWM0_CSGTRG_D2SES_Msk               (0x01UL << HRPWM0_CSGTRG_D2SES_Pos)                     /*!< HRPWM0 CSGTRG: D2SES Mask               */
#define HRPWM0_CSGTRG_D2SVS_Pos               9                                                       /*!< HRPWM0 CSGTRG: D2SVS Position           */
#define HRPWM0_CSGTRG_D2SVS_Msk               (0x01UL << HRPWM0_CSGTRG_D2SVS_Pos)                     /*!< HRPWM0 CSGTRG: D2SVS Mask               */

/* --------------------------------  HRPWM0_CSGTRC  ------------------------------- */
#define HRPWM0_CSGTRC_D0SEC_Pos               0                                                       /*!< HRPWM0 CSGTRC: D0SEC Position           */
#define HRPWM0_CSGTRC_D0SEC_Msk               (0x01UL << HRPWM0_CSGTRC_D0SEC_Pos)                     /*!< HRPWM0 CSGTRC: D0SEC Mask               */
#define HRPWM0_CSGTRC_D1SEC_Pos               4                                                       /*!< HRPWM0 CSGTRC: D1SEC Position           */
#define HRPWM0_CSGTRC_D1SEC_Msk               (0x01UL << HRPWM0_CSGTRC_D1SEC_Pos)                     /*!< HRPWM0 CSGTRC: D1SEC Mask               */
#define HRPWM0_CSGTRC_D2SEC_Pos               8                                                       /*!< HRPWM0 CSGTRC: D2SEC Position           */
#define HRPWM0_CSGTRC_D2SEC_Msk               (0x01UL << HRPWM0_CSGTRC_D2SEC_Pos)                     /*!< HRPWM0 CSGTRC: D2SEC Mask               */

