FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4200.h
/* -------------------------------  HRPWM0_HRCCTRG  ------------------------------- */
#define HRPWM0_HRCCTRG_H0EC_Pos               0                                                       /*!< HRPWM0 HRCCTRG: H0EC Position           */
#define HRPWM0_HRCCTRG_H0EC_Msk               (0x01UL << HRPWM0_HRCCTRG_H0EC_Pos)                     /*!< HRPWM0 HRCCTRG: H0EC Mask               */
#define HRPWM0_HRCCTRG_H0DEC_Pos              1                                                       /*!< HRPWM0 HRCCTRG: H0DEC Position          */
#define HRPWM0_HRCCTRG_H0DEC_Msk              (0x01UL << HRPWM0_HRCCTRG_H0DEC_Pos)                    /*!< HRPWM0 HRCCTRG: H0DEC Mask              */
#define HRPWM0_HRCCTRG_H1EC_Pos               4                                                       /*!< HRPWM0 HRCCTRG: H1EC Position           */
#define HRPWM0_HRCCTRG_H1EC_Msk               (0x01UL << HRPWM0_HRCCTRG_H1EC_Pos)                     /*!< HRPWM0 HRCCTRG: H1EC Mask               */
#define HRPWM0_HRCCTRG_H1DEC_Pos              5                                                       /*!< HRPWM0 HRCCTRG: H1DEC Position          */
#define HRPWM0_HRCCTRG_H1DEC_Msk              (0x01UL << HRPWM0_HRCCTRG_H1DEC_Pos)                    /*!< HRPWM0 HRCCTRG: H1DEC Mask              */
#define HRPWM0_HRCCTRG_H2CEC_Pos              8                                                       /*!< HRPWM0 HRCCTRG: H2CEC Position          */
#define HRPWM0_HRCCTRG_H2CEC_Msk              (0x01UL << HRPWM0_HRCCTRG_H2CEC_Pos)                    /*!< HRPWM0 HRCCTRG: H2CEC Mask              */
#define HRPWM0_HRCCTRG_H2DEC_Pos              9                                                       /*!< HRPWM0 HRCCTRG: H2DEC Position          */
#define HRPWM0_HRCCTRG_H2DEC_Msk              (0x01UL << HRPWM0_HRCCTRG_H2DEC_Pos)                    /*!< HRPWM0 HRCCTRG: H2DEC Mask              */
#define HRPWM0_HRCCTRG_H3EC_Pos               12                                                      /*!< HRPWM0 HRCCTRG: H3EC Position           */
#define HRPWM0_HRCCTRG_H3EC_Msk               (0x01UL << HRPWM0_HRCCTRG_H3EC_Pos)                     /*!< HRPWM0 HRCCTRG: H3EC Mask               */
#define HRPWM0_HRCCTRG_H3DEC_Pos              13                                                      /*!< HRPWM0 HRCCTRG: H3DEC Position          */
#define HRPWM0_HRCCTRG_H3DEC_Msk              (0x01UL << HRPWM0_HRCCTRG_H3DEC_Pos)                    /*!< HRPWM0 HRCCTRG: H3DEC Mask              */

/* -------------------------------  HRPWM0_HRCSTSG  ------------------------------- */
#define HRPWM0_HRCSTSG_H0STE_Pos              0                                                       /*!< HRPWM0 HRCSTSG: H0STE Position          */
#define HRPWM0_HRCSTSG_H0STE_Msk              (0x01UL << HRPWM0_HRCSTSG_H0STE_Pos)                    /*!< HRPWM0 HRCSTSG: H0STE Mask              */
#define HRPWM0_HRCSTSG_H0DSTE_Pos             1                                                       /*!< HRPWM0 HRCSTSG: H0DSTE Position         */
#define HRPWM0_HRCSTSG_H0DSTE_Msk             (0x01UL << HRPWM0_HRCSTSG_H0DSTE_Pos)                   /*!< HRPWM0 HRCSTSG: H0DSTE Mask             */
#define HRPWM0_HRCSTSG_H1STE_Pos              4                                                       /*!< HRPWM0 HRCSTSG: H1STE Position          */
#define HRPWM0_HRCSTSG_H1STE_Msk              (0x01UL << HRPWM0_HRCSTSG_H1STE_Pos)                    /*!< HRPWM0 HRCSTSG: H1STE Mask              */
#define HRPWM0_HRCSTSG_H1DSTE_Pos             5                                                       /*!< HRPWM0 HRCSTSG: H1DSTE Position         */
#define HRPWM0_HRCSTSG_H1DSTE_Msk             (0x01UL << HRPWM0_HRCSTSG_H1DSTE_Pos)                   /*!< HRPWM0 HRCSTSG: H1DSTE Mask             */
#define HRPWM0_HRCSTSG_H2STE_Pos              8                                                       /*!< HRPWM0 HRCSTSG: H2STE Position          */
#define HRPWM0_HRCSTSG_H2STE_Msk              (0x01UL << HRPWM0_HRCSTSG_H2STE_Pos)                    /*!< HRPWM0 HRCSTSG: H2STE Mask              */
#define HRPWM0_HRCSTSG_H2DSTE_Pos             9                                                       /*!< HRPWM0 HRCSTSG: H2DSTE Position         */
#define HRPWM0_HRCSTSG_H2DSTE_Msk             (0x01UL << HRPWM0_HRCSTSG_H2DSTE_Pos)                   /*!< HRPWM0 HRCSTSG: H2DSTE Mask             */
#define HRPWM0_HRCSTSG_H3STE_Pos              12                                                      /*!< HRPWM0 HRCSTSG: H3STE Position          */
#define HRPWM0_HRCSTSG_H3STE_Msk              (0x01UL << HRPWM0_HRCSTSG_H3STE_Pos)                    /*!< HRPWM0 HRCSTSG: H3STE Mask              */
#define HRPWM0_HRCSTSG_H3DSTE_Pos             13                                                      /*!< HRPWM0 HRCSTSG: H3DSTE Position         */
#define HRPWM0_HRCSTSG_H3DSTE_Msk             (0x01UL << HRPWM0_HRCSTSG_H3DSTE_Pos)                   /*!< HRPWM0 HRCSTSG: H3DSTE Mask             */

/* --------------------------------  HRPWM0_HRGHRS  ------------------------------- */
#define HRPWM0_HRGHRS_HRGR_Pos                0                                                       /*!< HRPWM0 HRGHRS: HRGR Position            */
#define HRPWM0_HRGHRS_HRGR_Msk                (0x01UL << HRPWM0_HRGHRS_HRGR_Pos)                      /*!< HRPWM0 HRGHRS: HRGR Mask                */


/* ================================================================================ */
/* ================       Group 'HRPWM0_CSG' Position & Mask       ================ */
/* ================================================================================ */


/* -------------------------------  HRPWM0_CSG_DCI  ------------------------------- */
#define HRPWM0_CSG_DCI_SVIS_Pos               0                                                       /*!< HRPWM0_CSG DCI: SVIS Position           */
#define HRPWM0_CSG_DCI_SVIS_Msk               (0x0fUL << HRPWM0_CSG_DCI_SVIS_Pos)                     /*!< HRPWM0_CSG DCI: SVIS Mask               */
#define HRPWM0_CSG_DCI_STRIS_Pos              4                                                       /*!< HRPWM0_CSG DCI: STRIS Position          */
#define HRPWM0_CSG_DCI_STRIS_Msk              (0x0fUL << HRPWM0_CSG_DCI_STRIS_Pos)                    /*!< HRPWM0_CSG DCI: STRIS Mask              */
#define HRPWM0_CSG_DCI_STPIS_Pos              8                                                       /*!< HRPWM0_CSG DCI: STPIS Position          */
#define HRPWM0_CSG_DCI_STPIS_Msk              (0x0fUL << HRPWM0_CSG_DCI_STPIS_Pos)                    /*!< HRPWM0_CSG DCI: STPIS Mask              */
#define HRPWM0_CSG_DCI_TRGIS_Pos              12                                                      /*!< HRPWM0_CSG DCI: TRGIS Position          */
#define HRPWM0_CSG_DCI_TRGIS_Msk              (0x0fUL << HRPWM0_CSG_DCI_TRGIS_Pos)                    /*!< HRPWM0_CSG DCI: TRGIS Mask              */
#define HRPWM0_CSG_DCI_STIS_Pos               16                                                      /*!< HRPWM0_CSG DCI: STIS Position           */
#define HRPWM0_CSG_DCI_STIS_Msk               (0x0fUL << HRPWM0_CSG_DCI_STIS_Pos)                     /*!< HRPWM0_CSG DCI: STIS Mask               */
#define HRPWM0_CSG_DCI_SCS_Pos                20                                                      /*!< HRPWM0_CSG DCI: SCS Position            */
#define HRPWM0_CSG_DCI_SCS_Msk                (0x03UL << HRPWM0_CSG_DCI_SCS_Pos)                      /*!< HRPWM0_CSG DCI: SCS Mask                */

/* -------------------------------  HRPWM0_CSG_IES  ------------------------------- */
#define HRPWM0_CSG_IES_SVLS_Pos               0                                                       /*!< HRPWM0_CSG IES: SVLS Position           */
#define HRPWM0_CSG_IES_SVLS_Msk               (0x03UL << HRPWM0_CSG_IES_SVLS_Pos)                     /*!< HRPWM0_CSG IES: SVLS Mask               */
#define HRPWM0_CSG_IES_STRES_Pos              2                                                       /*!< HRPWM0_CSG IES: STRES Position          */
#define HRPWM0_CSG_IES_STRES_Msk              (0x03UL << HRPWM0_CSG_IES_STRES_Pos)                    /*!< HRPWM0_CSG IES: STRES Mask              */
#define HRPWM0_CSG_IES_STPES_Pos              4                                                       /*!< HRPWM0_CSG IES: STPES Position          */
#define HRPWM0_CSG_IES_STPES_Msk              (0x03UL << HRPWM0_CSG_IES_STPES_Pos)                    /*!< HRPWM0_CSG IES: STPES Mask              */
#define HRPWM0_CSG_IES_TRGES_Pos              6                                                       /*!< HRPWM0_CSG IES: TRGES Position          */
#define HRPWM0_CSG_IES_TRGES_Msk              (0x03UL << HRPWM0_CSG_IES_TRGES_Pos)                    /*!< HRPWM0_CSG IES: TRGES Mask              */
#define HRPWM0_CSG_IES_STES_Pos               8                                                       /*!< HRPWM0_CSG IES: STES Position           */
#define HRPWM0_CSG_IES_STES_Msk               (0x03UL << HRPWM0_CSG_IES_STES_Pos)                     /*!< HRPWM0_CSG IES: STES Mask               */

