FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4200.h
/* --------------------------------  HRPWM0_CSG_SC  ------------------------------- */
#define HRPWM0_CSG_SC_PSRM_Pos                0                                                       /*!< HRPWM0_CSG SC: PSRM Position            */
#define HRPWM0_CSG_SC_PSRM_Msk                (0x03UL << HRPWM0_CSG_SC_PSRM_Pos)                      /*!< HRPWM0_CSG SC: PSRM Mask                */
#define HRPWM0_CSG_SC_PSTM_Pos                2                                                       /*!< HRPWM0_CSG SC: PSTM Position            */
#define HRPWM0_CSG_SC_PSTM_Msk                (0x03UL << HRPWM0_CSG_SC_PSTM_Pos)                      /*!< HRPWM0_CSG SC: PSTM Mask                */
#define HRPWM0_CSG_SC_FPD_Pos                 4                                                       /*!< HRPWM0_CSG SC: FPD Position             */
#define HRPWM0_CSG_SC_FPD_Msk                 (0x01UL << HRPWM0_CSG_SC_FPD_Pos)                       /*!< HRPWM0_CSG SC: FPD Mask                 */
#define HRPWM0_CSG_SC_PSV_Pos                 5                                                       /*!< HRPWM0_CSG SC: PSV Position             */
#define HRPWM0_CSG_SC_PSV_Msk                 (0x03UL << HRPWM0_CSG_SC_PSV_Pos)                       /*!< HRPWM0_CSG SC: PSV Mask                 */
#define HRPWM0_CSG_SC_SCM_Pos                 8                                                       /*!< HRPWM0_CSG SC: SCM Position             */
#define HRPWM0_CSG_SC_SCM_Msk                 (0x03UL << HRPWM0_CSG_SC_SCM_Pos)                       /*!< HRPWM0_CSG SC: SCM Mask                 */
#define HRPWM0_CSG_SC_SSRM_Pos                10                                                      /*!< HRPWM0_CSG SC: SSRM Position            */
#define HRPWM0_CSG_SC_SSRM_Msk                (0x03UL << HRPWM0_CSG_SC_SSRM_Pos)                      /*!< HRPWM0_CSG SC: SSRM Mask                */
#define HRPWM0_CSG_SC_SSTM_Pos                12                                                      /*!< HRPWM0_CSG SC: SSTM Position            */
#define HRPWM0_CSG_SC_SSTM_Msk                (0x03UL << HRPWM0_CSG_SC_SSTM_Pos)                      /*!< HRPWM0_CSG SC: SSTM Mask                */
#define HRPWM0_CSG_SC_SVSC_Pos                14                                                      /*!< HRPWM0_CSG SC: SVSC Position            */
#define HRPWM0_CSG_SC_SVSC_Msk                (0x03UL << HRPWM0_CSG_SC_SVSC_Pos)                      /*!< HRPWM0_CSG SC: SVSC Mask                */
#define HRPWM0_CSG_SC_SWSM_Pos                16                                                      /*!< HRPWM0_CSG SC: SWSM Position            */
#define HRPWM0_CSG_SC_SWSM_Msk                (0x03UL << HRPWM0_CSG_SC_SWSM_Pos)                      /*!< HRPWM0_CSG SC: SWSM Mask                */
#define HRPWM0_CSG_SC_GCFG_Pos                18                                                      /*!< HRPWM0_CSG SC: GCFG Position            */
#define HRPWM0_CSG_SC_GCFG_Msk                (0x03UL << HRPWM0_CSG_SC_GCFG_Pos)                      /*!< HRPWM0_CSG SC: GCFG Mask                */
#define HRPWM0_CSG_SC_IST_Pos                 20                                                      /*!< HRPWM0_CSG SC: IST Position             */
#define HRPWM0_CSG_SC_IST_Msk                 (0x01UL << HRPWM0_CSG_SC_IST_Pos)                       /*!< HRPWM0_CSG SC: IST Mask                 */
#define HRPWM0_CSG_SC_PSE_Pos                 21                                                      /*!< HRPWM0_CSG SC: PSE Position             */
#define HRPWM0_CSG_SC_PSE_Msk                 (0x01UL << HRPWM0_CSG_SC_PSE_Pos)                       /*!< HRPWM0_CSG SC: PSE Mask                 */
#define HRPWM0_CSG_SC_PSWM_Pos                24                                                      /*!< HRPWM0_CSG SC: PSWM Position            */
#define HRPWM0_CSG_SC_PSWM_Msk                (0x03UL << HRPWM0_CSG_SC_PSWM_Pos)                      /*!< HRPWM0_CSG SC: PSWM Mask                */

/* --------------------------------  HRPWM0_CSG_PC  ------------------------------- */
#define HRPWM0_CSG_PC_PSWV_Pos                0                                                       /*!< HRPWM0_CSG PC: PSWV Position            */
#define HRPWM0_CSG_PC_PSWV_Msk                (0x3fUL << HRPWM0_CSG_PC_PSWV_Pos)                      /*!< HRPWM0_CSG PC: PSWV Mask                */

/* -------------------------------  HRPWM0_CSG_DSV1  ------------------------------ */
#define HRPWM0_CSG_DSV1_DSV1_Pos              0                                                       /*!< HRPWM0_CSG DSV1: DSV1 Position          */
#define HRPWM0_CSG_DSV1_DSV1_Msk              (0x000003ffUL << HRPWM0_CSG_DSV1_DSV1_Pos)              /*!< HRPWM0_CSG DSV1: DSV1 Mask              */

/* -------------------------------  HRPWM0_CSG_DSV2  ------------------------------ */
#define HRPWM0_CSG_DSV2_DSV2_Pos              0                                                       /*!< HRPWM0_CSG DSV2: DSV2 Position          */
#define HRPWM0_CSG_DSV2_DSV2_Msk              (0x000003ffUL << HRPWM0_CSG_DSV2_DSV2_Pos)              /*!< HRPWM0_CSG DSV2: DSV2 Mask              */

/* ------------------------------  HRPWM0_CSG_SDSV1  ------------------------------ */
#define HRPWM0_CSG_SDSV1_SDSV1_Pos            0                                                       /*!< HRPWM0_CSG SDSV1: SDSV1 Position        */
#define HRPWM0_CSG_SDSV1_SDSV1_Msk            (0x000003ffUL << HRPWM0_CSG_SDSV1_SDSV1_Pos)            /*!< HRPWM0_CSG SDSV1: SDSV1 Mask            */

/* -------------------------------  HRPWM0_CSG_SPC  ------------------------------- */
#define HRPWM0_CSG_SPC_SPSWV_Pos              0                                                       /*!< HRPWM0_CSG SPC: SPSWV Position          */
#define HRPWM0_CSG_SPC_SPSWV_Msk              (0x3fUL << HRPWM0_CSG_SPC_SPSWV_Pos)                    /*!< HRPWM0_CSG SPC: SPSWV Mask              */

/* --------------------------------  HRPWM0_CSG_CC  ------------------------------- */
#define HRPWM0_CSG_CC_IBS_Pos                 0                                                       /*!< HRPWM0_CSG CC: IBS Position             */
#define HRPWM0_CSG_CC_IBS_Msk                 (0x0fUL << HRPWM0_CSG_CC_IBS_Pos)                       /*!< HRPWM0_CSG CC: IBS Mask                 */
#define HRPWM0_CSG_CC_IMCS_Pos                8                                                       /*!< HRPWM0_CSG CC: IMCS Position            */
#define HRPWM0_CSG_CC_IMCS_Msk                (0x01UL << HRPWM0_CSG_CC_IMCS_Pos)                      /*!< HRPWM0_CSG CC: IMCS Mask                */
#define HRPWM0_CSG_CC_IMCC_Pos                9                                                       /*!< HRPWM0_CSG CC: IMCC Position            */
#define HRPWM0_CSG_CC_IMCC_Msk                (0x03UL << HRPWM0_CSG_CC_IMCC_Pos)                      /*!< HRPWM0_CSG CC: IMCC Mask                */
#define HRPWM0_CSG_CC_ESE_Pos                 11                                                      /*!< HRPWM0_CSG CC: ESE Position             */
#define HRPWM0_CSG_CC_ESE_Msk                 (0x01UL << HRPWM0_CSG_CC_ESE_Pos)                       /*!< HRPWM0_CSG CC: ESE Mask                 */
#define HRPWM0_CSG_CC_OIE_Pos                 12                                                      /*!< HRPWM0_CSG CC: OIE Position             */
#define HRPWM0_CSG_CC_OIE_Msk                 (0x01UL << HRPWM0_CSG_CC_OIE_Pos)                       /*!< HRPWM0_CSG CC: OIE Mask                 */
#define HRPWM0_CSG_CC_OSE_Pos                 13                                                      /*!< HRPWM0_CSG CC: OSE Position             */
#define HRPWM0_CSG_CC_OSE_Msk                 (0x01UL << HRPWM0_CSG_CC_OSE_Pos)                       /*!< HRPWM0_CSG CC: OSE Mask                 */
#define HRPWM0_CSG_CC_BLMC_Pos                14                                                      /*!< HRPWM0_CSG CC: BLMC Position            */
#define HRPWM0_CSG_CC_BLMC_Msk                (0x03UL << HRPWM0_CSG_CC_BLMC_Pos)                      /*!< HRPWM0_CSG CC: BLMC Mask                */
#define HRPWM0_CSG_CC_EBE_Pos                 16                                                      /*!< HRPWM0_CSG CC: EBE Position             */
#define HRPWM0_CSG_CC_EBE_Msk                 (0x01UL << HRPWM0_CSG_CC_EBE_Pos)                       /*!< HRPWM0_CSG CC: EBE Mask                 */
#define HRPWM0_CSG_CC_COFE_Pos                17                                                      /*!< HRPWM0_CSG CC: COFE Position            */
#define HRPWM0_CSG_CC_COFE_Msk                (0x01UL << HRPWM0_CSG_CC_COFE_Pos)                      /*!< HRPWM0_CSG CC: COFE Mask                */
#define HRPWM0_CSG_CC_COFM_Pos                18                                                      /*!< HRPWM0_CSG CC: COFM Position            */
#define HRPWM0_CSG_CC_COFM_Msk                (0x0fUL << HRPWM0_CSG_CC_COFM_Pos)                      /*!< HRPWM0_CSG CC: COFM Mask                */
#define HRPWM0_CSG_CC_COFC_Pos                24                                                      /*!< HRPWM0_CSG CC: COFC Position            */
#define HRPWM0_CSG_CC_COFC_Msk                (0x03UL << HRPWM0_CSG_CC_COFC_Pos)                      /*!< HRPWM0_CSG CC: COFC Mask                */

/* -------------------------------  HRPWM0_CSG_PLC  ------------------------------- */
#define HRPWM0_CSG_PLC_IPLS_Pos               0                                                       /*!< HRPWM0_CSG PLC: IPLS Position           */
#define HRPWM0_CSG_PLC_IPLS_Msk               (0x0fUL << HRPWM0_CSG_PLC_IPLS_Pos)                     /*!< HRPWM0_CSG PLC: IPLS Mask               */
#define HRPWM0_CSG_PLC_PLCL_Pos               8                                                       /*!< HRPWM0_CSG PLC: PLCL Position           */
#define HRPWM0_CSG_PLC_PLCL_Msk               (0x03UL << HRPWM0_CSG_PLC_PLCL_Pos)                     /*!< HRPWM0_CSG PLC: PLCL Mask               */
#define HRPWM0_CSG_PLC_PSL_Pos                10                                                      /*!< HRPWM0_CSG PLC: PSL Position            */
#define HRPWM0_CSG_PLC_PSL_Msk                (0x01UL << HRPWM0_CSG_PLC_PSL_Pos)                      /*!< HRPWM0_CSG PLC: PSL Mask                */
#define HRPWM0_CSG_PLC_PLSW_Pos               11                                                      /*!< HRPWM0_CSG PLC: PLSW Position           */
#define HRPWM0_CSG_PLC_PLSW_Msk               (0x01UL << HRPWM0_CSG_PLC_PLSW_Pos)                     /*!< HRPWM0_CSG PLC: PLSW Mask               */
#define HRPWM0_CSG_PLC_PLEC_Pos               12                                                      /*!< HRPWM0_CSG PLC: PLEC Position           */
#define HRPWM0_CSG_PLC_PLEC_Msk               (0x03UL << HRPWM0_CSG_PLC_PLEC_Pos)                     /*!< HRPWM0_CSG PLC: PLEC Mask               */
#define HRPWM0_CSG_PLC_PLXC_Pos               14                                                      /*!< HRPWM0_CSG PLC: PLXC Position           */
#define HRPWM0_CSG_PLC_PLXC_Msk               (0x03UL << HRPWM0_CSG_PLC_PLXC_Pos)                     /*!< HRPWM0_CSG PLC: PLXC Mask               */

/* -------------------------------  HRPWM0_CSG_BLV  ------------------------------- */
#define HRPWM0_CSG_BLV_BLV_Pos                0                                                       /*!< HRPWM0_CSG BLV: BLV Position            */
#define HRPWM0_CSG_BLV_BLV_Msk                (0x000000ffUL << HRPWM0_CSG_BLV_BLV_Pos)                /*!< HRPWM0_CSG BLV: BLV Mask                */

/* -------------------------------  HRPWM0_CSG_SRE  ------------------------------- */
#define HRPWM0_CSG_SRE_VLS1E_Pos              0                                                       /*!< HRPWM0_CSG SRE: VLS1E Position          */
#define HRPWM0_CSG_SRE_VLS1E_Msk              (0x01UL << HRPWM0_CSG_SRE_VLS1E_Pos)                    /*!< HRPWM0_CSG SRE: VLS1E Mask              */
#define HRPWM0_CSG_SRE_VLS2E_Pos              1                                                       /*!< HRPWM0_CSG SRE: VLS2E Position          */
#define HRPWM0_CSG_SRE_VLS2E_Msk              (0x01UL << HRPWM0_CSG_SRE_VLS2E_Pos)                    /*!< HRPWM0_CSG SRE: VLS2E Mask              */
#define HRPWM0_CSG_SRE_TRGSE_Pos              2                                                       /*!< HRPWM0_CSG SRE: TRGSE Position          */
#define HRPWM0_CSG_SRE_TRGSE_Msk              (0x01UL << HRPWM0_CSG_SRE_TRGSE_Pos)                    /*!< HRPWM0_CSG SRE: TRGSE Mask              */
#define HRPWM0_CSG_SRE_STRSE_Pos              3                                                       /*!< HRPWM0_CSG SRE: STRSE Position          */
#define HRPWM0_CSG_SRE_STRSE_Msk              (0x01UL << HRPWM0_CSG_SRE_STRSE_Pos)                    /*!< HRPWM0_CSG SRE: STRSE Mask              */
#define HRPWM0_CSG_SRE_STPSE_Pos              4                                                       /*!< HRPWM0_CSG SRE: STPSE Position          */
#define HRPWM0_CSG_SRE_STPSE_Msk              (0x01UL << HRPWM0_CSG_SRE_STPSE_Pos)                    /*!< HRPWM0_CSG SRE: STPSE Mask              */
#define HRPWM0_CSG_SRE_STDE_Pos               5                                                       /*!< HRPWM0_CSG SRE: STDE Position           */
#define HRPWM0_CSG_SRE_STDE_Msk               (0x01UL << HRPWM0_CSG_SRE_STDE_Pos)                     /*!< HRPWM0_CSG SRE: STDE Mask               */
#define HRPWM0_CSG_SRE_CRSE_Pos               6                                                       /*!< HRPWM0_CSG SRE: CRSE Position           */
#define HRPWM0_CSG_SRE_CRSE_Msk               (0x01UL << HRPWM0_CSG_SRE_CRSE_Pos)                     /*!< HRPWM0_CSG SRE: CRSE Mask               */
#define HRPWM0_CSG_SRE_CFSE_Pos               7                                                       /*!< HRPWM0_CSG SRE: CFSE Position           */
#define HRPWM0_CSG_SRE_CFSE_Msk               (0x01UL << HRPWM0_CSG_SRE_CFSE_Pos)                     /*!< HRPWM0_CSG SRE: CFSE Mask               */
#define HRPWM0_CSG_SRE_CSEE_Pos               8                                                       /*!< HRPWM0_CSG SRE: CSEE Position           */
#define HRPWM0_CSG_SRE_CSEE_Msk               (0x01UL << HRPWM0_CSG_SRE_CSEE_Pos)                     /*!< HRPWM0_CSG SRE: CSEE Mask               */

