FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4200.h
/* -------------------------------  HRPWM0_CSG2_SC  ------------------------------- */
#define HRPWM0_CSG2_SC_PSRM_Pos               0                                                       /*!< HRPWM0_CSG2 SC: PSRM Position           */
#define HRPWM0_CSG2_SC_PSRM_Msk               (0x03UL << HRPWM0_CSG2_SC_PSRM_Pos)                     /*!< HRPWM0_CSG2 SC: PSRM Mask               */
#define HRPWM0_CSG2_SC_PSTM_Pos               2                                                       /*!< HRPWM0_CSG2 SC: PSTM Position           */
#define HRPWM0_CSG2_SC_PSTM_Msk               (0x03UL << HRPWM0_CSG2_SC_PSTM_Pos)                     /*!< HRPWM0_CSG2 SC: PSTM Mask               */
#define HRPWM0_CSG2_SC_FPD_Pos                4                                                       /*!< HRPWM0_CSG2 SC: FPD Position            */
#define HRPWM0_CSG2_SC_FPD_Msk                (0x01UL << HRPWM0_CSG2_SC_FPD_Pos)                      /*!< HRPWM0_CSG2 SC: FPD Mask                */
#define HRPWM0_CSG2_SC_PSV_Pos                5                                                       /*!< HRPWM0_CSG2 SC: PSV Position            */
#define HRPWM0_CSG2_SC_PSV_Msk                (0x03UL << HRPWM0_CSG2_SC_PSV_Pos)                      /*!< HRPWM0_CSG2 SC: PSV Mask                */
#define HRPWM0_CSG2_SC_SCM_Pos                8                                                       /*!< HRPWM0_CSG2 SC: SCM Position            */
#define HRPWM0_CSG2_SC_SCM_Msk                (0x03UL << HRPWM0_CSG2_SC_SCM_Pos)                      /*!< HRPWM0_CSG2 SC: SCM Mask                */
#define HRPWM0_CSG2_SC_SSRM_Pos               10                                                      /*!< HRPWM0_CSG2 SC: SSRM Position           */
#define HRPWM0_CSG2_SC_SSRM_Msk               (0x03UL << HRPWM0_CSG2_SC_SSRM_Pos)                     /*!< HRPWM0_CSG2 SC: SSRM Mask               */
#define HRPWM0_CSG2_SC_SSTM_Pos               12                                                      /*!< HRPWM0_CSG2 SC: SSTM Position           */
#define HRPWM0_CSG2_SC_SSTM_Msk               (0x03UL << HRPWM0_CSG2_SC_SSTM_Pos)                     /*!< HRPWM0_CSG2 SC: SSTM Mask               */
#define HRPWM0_CSG2_SC_SVSC_Pos               14                                                      /*!< HRPWM0_CSG2 SC: SVSC Position           */
#define HRPWM0_CSG2_SC_SVSC_Msk               (0x03UL << HRPWM0_CSG2_SC_SVSC_Pos)                     /*!< HRPWM0_CSG2 SC: SVSC Mask               */
#define HRPWM0_CSG2_SC_SWSM_Pos               16                                                      /*!< HRPWM0_CSG2 SC: SWSM Position           */
#define HRPWM0_CSG2_SC_SWSM_Msk               (0x03UL << HRPWM0_CSG2_SC_SWSM_Pos)                     /*!< HRPWM0_CSG2 SC: SWSM Mask               */
#define HRPWM0_CSG2_SC_GCFG_Pos               18                                                      /*!< HRPWM0_CSG2 SC: GCFG Position           */
#define HRPWM0_CSG2_SC_GCFG_Msk               (0x03UL << HRPWM0_CSG2_SC_GCFG_Pos)                     /*!< HRPWM0_CSG2 SC: GCFG Mask               */
#define HRPWM0_CSG2_SC_IST_Pos                20                                                      /*!< HRPWM0_CSG2 SC: IST Position            */
#define HRPWM0_CSG2_SC_IST_Msk                (0x01UL << HRPWM0_CSG2_SC_IST_Pos)                      /*!< HRPWM0_CSG2 SC: IST Mask                */
#define HRPWM0_CSG2_SC_PSE_Pos                21                                                      /*!< HRPWM0_CSG2 SC: PSE Position            */
#define HRPWM0_CSG2_SC_PSE_Msk                (0x01UL << HRPWM0_CSG2_SC_PSE_Pos)                      /*!< HRPWM0_CSG2 SC: PSE Mask                */
#define HRPWM0_CSG2_SC_PSWM_Pos               24                                                      /*!< HRPWM0_CSG2 SC: PSWM Position           */
#define HRPWM0_CSG2_SC_PSWM_Msk               (0x03UL << HRPWM0_CSG2_SC_PSWM_Pos)                     /*!< HRPWM0_CSG2 SC: PSWM Mask               */

/* -------------------------------  HRPWM0_CSG2_PC  ------------------------------- */
#define HRPWM0_CSG2_PC_PSWV_Pos               0                                                       /*!< HRPWM0_CSG2 PC: PSWV Position           */
#define HRPWM0_CSG2_PC_PSWV_Msk               (0x3fUL << HRPWM0_CSG2_PC_PSWV_Pos)                     /*!< HRPWM0_CSG2 PC: PSWV Mask               */

/* ------------------------------  HRPWM0_CSG2_DSV1  ------------------------------ */
#define HRPWM0_CSG2_DSV1_DSV1_Pos             0                                                       /*!< HRPWM0_CSG2 DSV1: DSV1 Position         */
#define HRPWM0_CSG2_DSV1_DSV1_Msk             (0x000003ffUL << HRPWM0_CSG2_DSV1_DSV1_Pos)             /*!< HRPWM0_CSG2 DSV1: DSV1 Mask             */

/* ------------------------------  HRPWM0_CSG2_DSV2  ------------------------------ */
#define HRPWM0_CSG2_DSV2_DSV2_Pos             0                                                       /*!< HRPWM0_CSG2 DSV2: DSV2 Position         */
#define HRPWM0_CSG2_DSV2_DSV2_Msk             (0x000003ffUL << HRPWM0_CSG2_DSV2_DSV2_Pos)             /*!< HRPWM0_CSG2 DSV2: DSV2 Mask             */

/* ------------------------------  HRPWM0_CSG2_SDSV1  ----------------------------- */
#define HRPWM0_CSG2_SDSV1_SDSV1_Pos           0                                                       /*!< HRPWM0_CSG2 SDSV1: SDSV1 Position       */
#define HRPWM0_CSG2_SDSV1_SDSV1_Msk           (0x000003ffUL << HRPWM0_CSG2_SDSV1_SDSV1_Pos)           /*!< HRPWM0_CSG2 SDSV1: SDSV1 Mask           */

/* -------------------------------  HRPWM0_CSG2_SPC  ------------------------------ */
#define HRPWM0_CSG2_SPC_SPSWV_Pos             0                                                       /*!< HRPWM0_CSG2 SPC: SPSWV Position         */
#define HRPWM0_CSG2_SPC_SPSWV_Msk             (0x3fUL << HRPWM0_CSG2_SPC_SPSWV_Pos)                   /*!< HRPWM0_CSG2 SPC: SPSWV Mask             */

/* -------------------------------  HRPWM0_CSG2_CC  ------------------------------- */
#define HRPWM0_CSG2_CC_IBS_Pos                0                                                       /*!< HRPWM0_CSG2 CC: IBS Position            */
#define HRPWM0_CSG2_CC_IBS_Msk                (0x0fUL << HRPWM0_CSG2_CC_IBS_Pos)                      /*!< HRPWM0_CSG2 CC: IBS Mask                */
#define HRPWM0_CSG2_CC_IMCS_Pos               8                                                       /*!< HRPWM0_CSG2 CC: IMCS Position           */
#define HRPWM0_CSG2_CC_IMCS_Msk               (0x01UL << HRPWM0_CSG2_CC_IMCS_Pos)                     /*!< HRPWM0_CSG2 CC: IMCS Mask               */
#define HRPWM0_CSG2_CC_IMCC_Pos               9                                                       /*!< HRPWM0_CSG2 CC: IMCC Position           */
#define HRPWM0_CSG2_CC_IMCC_Msk               (0x03UL << HRPWM0_CSG2_CC_IMCC_Pos)                     /*!< HRPWM0_CSG2 CC: IMCC Mask               */
#define HRPWM0_CSG2_CC_ESE_Pos                11                                                      /*!< HRPWM0_CSG2 CC: ESE Position            */
#define HRPWM0_CSG2_CC_ESE_Msk                (0x01UL << HRPWM0_CSG2_CC_ESE_Pos)                      /*!< HRPWM0_CSG2 CC: ESE Mask                */
#define HRPWM0_CSG2_CC_OIE_Pos                12                                                      /*!< HRPWM0_CSG2 CC: OIE Position            */
#define HRPWM0_CSG2_CC_OIE_Msk                (0x01UL << HRPWM0_CSG2_CC_OIE_Pos)                      /*!< HRPWM0_CSG2 CC: OIE Mask                */
#define HRPWM0_CSG2_CC_OSE_Pos                13                                                      /*!< HRPWM0_CSG2 CC: OSE Position            */
#define HRPWM0_CSG2_CC_OSE_Msk                (0x01UL << HRPWM0_CSG2_CC_OSE_Pos)                      /*!< HRPWM0_CSG2 CC: OSE Mask                */
#define HRPWM0_CSG2_CC_BLMC_Pos               14                                                      /*!< HRPWM0_CSG2 CC: BLMC Position           */
#define HRPWM0_CSG2_CC_BLMC_Msk               (0x03UL << HRPWM0_CSG2_CC_BLMC_Pos)                     /*!< HRPWM0_CSG2 CC: BLMC Mask               */
#define HRPWM0_CSG2_CC_EBE_Pos                16                                                      /*!< HRPWM0_CSG2 CC: EBE Position            */
#define HRPWM0_CSG2_CC_EBE_Msk                (0x01UL << HRPWM0_CSG2_CC_EBE_Pos)                      /*!< HRPWM0_CSG2 CC: EBE Mask                */
#define HRPWM0_CSG2_CC_COFE_Pos               17                                                      /*!< HRPWM0_CSG2 CC: COFE Position           */
#define HRPWM0_CSG2_CC_COFE_Msk               (0x01UL << HRPWM0_CSG2_CC_COFE_Pos)                     /*!< HRPWM0_CSG2 CC: COFE Mask               */
#define HRPWM0_CSG2_CC_COFM_Pos               18                                                      /*!< HRPWM0_CSG2 CC: COFM Position           */
#define HRPWM0_CSG2_CC_COFM_Msk               (0x0fUL << HRPWM0_CSG2_CC_COFM_Pos)                     /*!< HRPWM0_CSG2 CC: COFM Mask               */
#define HRPWM0_CSG2_CC_COFC_Pos               24                                                      /*!< HRPWM0_CSG2 CC: COFC Position           */
#define HRPWM0_CSG2_CC_COFC_Msk               (0x03UL << HRPWM0_CSG2_CC_COFC_Pos)                     /*!< HRPWM0_CSG2 CC: COFC Mask               */

/* -------------------------------  HRPWM0_CSG2_PLC  ------------------------------ */
#define HRPWM0_CSG2_PLC_IPLS_Pos              0                                                       /*!< HRPWM0_CSG2 PLC: IPLS Position          */
#define HRPWM0_CSG2_PLC_IPLS_Msk              (0x0fUL << HRPWM0_CSG2_PLC_IPLS_Pos)                    /*!< HRPWM0_CSG2 PLC: IPLS Mask              */
#define HRPWM0_CSG2_PLC_PLCL_Pos              8                                                       /*!< HRPWM0_CSG2 PLC: PLCL Position          */
#define HRPWM0_CSG2_PLC_PLCL_Msk              (0x03UL << HRPWM0_CSG2_PLC_PLCL_Pos)                    /*!< HRPWM0_CSG2 PLC: PLCL Mask              */
#define HRPWM0_CSG2_PLC_PSL_Pos               10                                                      /*!< HRPWM0_CSG2 PLC: PSL Position           */
#define HRPWM0_CSG2_PLC_PSL_Msk               (0x01UL << HRPWM0_CSG2_PLC_PSL_Pos)                     /*!< HRPWM0_CSG2 PLC: PSL Mask               */
#define HRPWM0_CSG2_PLC_PLSW_Pos              11                                                      /*!< HRPWM0_CSG2 PLC: PLSW Position          */
#define HRPWM0_CSG2_PLC_PLSW_Msk              (0x01UL << HRPWM0_CSG2_PLC_PLSW_Pos)                    /*!< HRPWM0_CSG2 PLC: PLSW Mask              */
#define HRPWM0_CSG2_PLC_PLEC_Pos              12                                                      /*!< HRPWM0_CSG2 PLC: PLEC Position          */
#define HRPWM0_CSG2_PLC_PLEC_Msk              (0x03UL << HRPWM0_CSG2_PLC_PLEC_Pos)                    /*!< HRPWM0_CSG2 PLC: PLEC Mask              */
#define HRPWM0_CSG2_PLC_PLXC_Pos              14                                                      /*!< HRPWM0_CSG2 PLC: PLXC Position          */
#define HRPWM0_CSG2_PLC_PLXC_Msk              (0x03UL << HRPWM0_CSG2_PLC_PLXC_Pos)                    /*!< HRPWM0_CSG2 PLC: PLXC Mask              */

/* -------------------------------  HRPWM0_CSG2_BLV  ------------------------------ */
#define HRPWM0_CSG2_BLV_BLV_Pos               0                                                       /*!< HRPWM0_CSG2 BLV: BLV Position           */
#define HRPWM0_CSG2_BLV_BLV_Msk               (0x000000ffUL << HRPWM0_CSG2_BLV_BLV_Pos)               /*!< HRPWM0_CSG2 BLV: BLV Mask               */

/* -------------------------------  HRPWM0_CSG2_SRE  ------------------------------ */
#define HRPWM0_CSG2_SRE_VLS1E_Pos             0                                                       /*!< HRPWM0_CSG2 SRE: VLS1E Position         */
#define HRPWM0_CSG2_SRE_VLS1E_Msk             (0x01UL << HRPWM0_CSG2_SRE_VLS1E_Pos)                   /*!< HRPWM0_CSG2 SRE: VLS1E Mask             */
#define HRPWM0_CSG2_SRE_VLS2E_Pos             1                                                       /*!< HRPWM0_CSG2 SRE: VLS2E Position         */
#define HRPWM0_CSG2_SRE_VLS2E_Msk             (0x01UL << HRPWM0_CSG2_SRE_VLS2E_Pos)                   /*!< HRPWM0_CSG2 SRE: VLS2E Mask             */
#define HRPWM0_CSG2_SRE_TRGSE_Pos             2                                                       /*!< HRPWM0_CSG2 SRE: TRGSE Position         */
#define HRPWM0_CSG2_SRE_TRGSE_Msk             (0x01UL << HRPWM0_CSG2_SRE_TRGSE_Pos)                   /*!< HRPWM0_CSG2 SRE: TRGSE Mask             */
#define HRPWM0_CSG2_SRE_STRSE_Pos             3                                                       /*!< HRPWM0_CSG2 SRE: STRSE Position         */
#define HRPWM0_CSG2_SRE_STRSE_Msk             (0x01UL << HRPWM0_CSG2_SRE_STRSE_Pos)                   /*!< HRPWM0_CSG2 SRE: STRSE Mask             */
#define HRPWM0_CSG2_SRE_STPSE_Pos             4                                                       /*!< HRPWM0_CSG2 SRE: STPSE Position         */
#define HRPWM0_CSG2_SRE_STPSE_Msk             (0x01UL << HRPWM0_CSG2_SRE_STPSE_Pos)                   /*!< HRPWM0_CSG2 SRE: STPSE Mask             */
#define HRPWM0_CSG2_SRE_STDE_Pos              5                                                       /*!< HRPWM0_CSG2 SRE: STDE Position          */
#define HRPWM0_CSG2_SRE_STDE_Msk              (0x01UL << HRPWM0_CSG2_SRE_STDE_Pos)                    /*!< HRPWM0_CSG2 SRE: STDE Mask              */
#define HRPWM0_CSG2_SRE_CRSE_Pos              6                                                       /*!< HRPWM0_CSG2 SRE: CRSE Position          */
#define HRPWM0_CSG2_SRE_CRSE_Msk              (0x01UL << HRPWM0_CSG2_SRE_CRSE_Pos)                    /*!< HRPWM0_CSG2 SRE: CRSE Mask              */
#define HRPWM0_CSG2_SRE_CFSE_Pos              7                                                       /*!< HRPWM0_CSG2 SRE: CFSE Position          */
#define HRPWM0_CSG2_SRE_CFSE_Msk              (0x01UL << HRPWM0_CSG2_SRE_CFSE_Pos)                    /*!< HRPWM0_CSG2 SRE: CFSE Mask              */
#define HRPWM0_CSG2_SRE_CSEE_Pos              8                                                       /*!< HRPWM0_CSG2 SRE: CSEE Position          */
#define HRPWM0_CSG2_SRE_CSEE_Msk              (0x01UL << HRPWM0_CSG2_SRE_CSEE_Pos)                    /*!< HRPWM0_CSG2 SRE: CSEE Mask              */

/* -------------------------------  HRPWM0_CSG2_SRS  ------------------------------ */
#define HRPWM0_CSG2_SRS_VLS1S_Pos             0                                                       /*!< HRPWM0_CSG2 SRS: VLS1S Position         */
#define HRPWM0_CSG2_SRS_VLS1S_Msk             (0x03UL << HRPWM0_CSG2_SRS_VLS1S_Pos)                   /*!< HRPWM0_CSG2 SRS: VLS1S Mask             */
#define HRPWM0_CSG2_SRS_VLS2S_Pos             2                                                       /*!< HRPWM0_CSG2 SRS: VLS2S Position         */
#define HRPWM0_CSG2_SRS_VLS2S_Msk             (0x03UL << HRPWM0_CSG2_SRS_VLS2S_Pos)                   /*!< HRPWM0_CSG2 SRS: VLS2S Mask             */
#define HRPWM0_CSG2_SRS_TRLS_Pos              4                                                       /*!< HRPWM0_CSG2 SRS: TRLS Position          */
#define HRPWM0_CSG2_SRS_TRLS_Msk              (0x03UL << HRPWM0_CSG2_SRS_TRLS_Pos)                    /*!< HRPWM0_CSG2 SRS: TRLS Mask              */
#define HRPWM0_CSG2_SRS_SSLS_Pos              6                                                       /*!< HRPWM0_CSG2 SRS: SSLS Position          */
#define HRPWM0_CSG2_SRS_SSLS_Msk              (0x03UL << HRPWM0_CSG2_SRS_SSLS_Pos)                    /*!< HRPWM0_CSG2 SRS: SSLS Mask              */
#define HRPWM0_CSG2_SRS_STLS_Pos              8                                                       /*!< HRPWM0_CSG2 SRS: STLS Position          */
#define HRPWM0_CSG2_SRS_STLS_Msk              (0x03UL << HRPWM0_CSG2_SRS_STLS_Pos)                    /*!< HRPWM0_CSG2 SRS: STLS Mask              */
#define HRPWM0_CSG2_SRS_CRFLS_Pos             10                                                      /*!< HRPWM0_CSG2 SRS: CRFLS Position         */
#define HRPWM0_CSG2_SRS_CRFLS_Msk             (0x03UL << HRPWM0_CSG2_SRS_CRFLS_Pos)                   /*!< HRPWM0_CSG2 SRS: CRFLS Mask             */
#define HRPWM0_CSG2_SRS_CSLS_Pos              12                                                      /*!< HRPWM0_CSG2 SRS: CSLS Position          */
#define HRPWM0_CSG2_SRS_CSLS_Msk              (0x03UL << HRPWM0_CSG2_SRS_CSLS_Pos)                    /*!< HRPWM0_CSG2 SRS: CSLS Mask              */

/* -------------------------------  HRPWM0_CSG2_SWS  ------------------------------ */
#define HRPWM0_CSG2_SWS_SVLS1_Pos             0                                                       /*!< HRPWM0_CSG2 SWS: SVLS1 Position         */
#define HRPWM0_CSG2_SWS_SVLS1_Msk             (0x01UL << HRPWM0_CSG2_SWS_SVLS1_Pos)                   /*!< HRPWM0_CSG2 SWS: SVLS1 Mask             */
#define HRPWM0_CSG2_SWS_SVLS2_Pos             1                                                       /*!< HRPWM0_CSG2 SWS: SVLS2 Position         */
#define HRPWM0_CSG2_SWS_SVLS2_Msk             (0x01UL << HRPWM0_CSG2_SWS_SVLS2_Pos)                   /*!< HRPWM0_CSG2 SWS: SVLS2 Mask             */
#define HRPWM0_CSG2_SWS_STRGS_Pos             2                                                       /*!< HRPWM0_CSG2 SWS: STRGS Position         */
#define HRPWM0_CSG2_SWS_STRGS_Msk             (0x01UL << HRPWM0_CSG2_SWS_STRGS_Pos)                   /*!< HRPWM0_CSG2 SWS: STRGS Mask             */
#define HRPWM0_CSG2_SWS_SSTRS_Pos             3                                                       /*!< HRPWM0_CSG2 SWS: SSTRS Position         */
#define HRPWM0_CSG2_SWS_SSTRS_Msk             (0x01UL << HRPWM0_CSG2_SWS_SSTRS_Pos)                   /*!< HRPWM0_CSG2 SWS: SSTRS Mask             */
#define HRPWM0_CSG2_SWS_SSTPS_Pos             4                                                       /*!< HRPWM0_CSG2 SWS: SSTPS Position         */
#define HRPWM0_CSG2_SWS_SSTPS_Msk             (0x01UL << HRPWM0_CSG2_SWS_SSTPS_Pos)                   /*!< HRPWM0_CSG2 SWS: SSTPS Mask             */
#define HRPWM0_CSG2_SWS_SSTD_Pos              5                                                       /*!< HRPWM0_CSG2 SWS: SSTD Position          */
#define HRPWM0_CSG2_SWS_SSTD_Msk              (0x01UL << HRPWM0_CSG2_SWS_SSTD_Pos)                    /*!< HRPWM0_CSG2 SWS: SSTD Mask              */
#define HRPWM0_CSG2_SWS_SCRS_Pos              6                                                       /*!< HRPWM0_CSG2 SWS: SCRS Position          */
#define HRPWM0_CSG2_SWS_SCRS_Msk              (0x01UL << HRPWM0_CSG2_SWS_SCRS_Pos)                    /*!< HRPWM0_CSG2 SWS: SCRS Mask              */
#define HRPWM0_CSG2_SWS_SCFS_Pos              7                                                       /*!< HRPWM0_CSG2 SWS: SCFS Position          */
#define HRPWM0_CSG2_SWS_SCFS_Msk              (0x01UL << HRPWM0_CSG2_SWS_SCFS_Pos)                    /*!< HRPWM0_CSG2 SWS: SCFS Mask              */
#define HRPWM0_CSG2_SWS_SCSS_Pos              8                                                       /*!< HRPWM0_CSG2 SWS: SCSS Position          */
#define HRPWM0_CSG2_SWS_SCSS_Msk              (0x01UL << HRPWM0_CSG2_SWS_SCSS_Pos)                    /*!< HRPWM0_CSG2 SWS: SCSS Mask              */

/* -------------------------------  HRPWM0_CSG2_SWC  ------------------------------ */
#define HRPWM0_CSG2_SWC_CVLS1_Pos             0                                                       /*!< HRPWM0_CSG2 SWC: CVLS1 Position         */
#define HRPWM0_CSG2_SWC_CVLS1_Msk             (0x01UL << HRPWM0_CSG2_SWC_CVLS1_Pos)                   /*!< HRPWM0_CSG2 SWC: CVLS1 Mask             */
#define HRPWM0_CSG2_SWC_CVLS2_Pos             1                                                       /*!< HRPWM0_CSG2 SWC: CVLS2 Position         */
#define HRPWM0_CSG2_SWC_CVLS2_Msk             (0x01UL << HRPWM0_CSG2_SWC_CVLS2_Pos)                   /*!< HRPWM0_CSG2 SWC: CVLS2 Mask             */
#define HRPWM0_CSG2_SWC_CTRGS_Pos             2                                                       /*!< HRPWM0_CSG2 SWC: CTRGS Position         */
#define HRPWM0_CSG2_SWC_CTRGS_Msk             (0x01UL << HRPWM0_CSG2_SWC_CTRGS_Pos)                   /*!< HRPWM0_CSG2 SWC: CTRGS Mask             */
#define HRPWM0_CSG2_SWC_CSTRS_Pos             3                                                       /*!< HRPWM0_CSG2 SWC: CSTRS Position         */
#define HRPWM0_CSG2_SWC_CSTRS_Msk             (0x01UL << HRPWM0_CSG2_SWC_CSTRS_Pos)                   /*!< HRPWM0_CSG2 SWC: CSTRS Mask             */
#define HRPWM0_CSG2_SWC_CSTPS_Pos             4                                                       /*!< HRPWM0_CSG2 SWC: CSTPS Position         */
#define HRPWM0_CSG2_SWC_CSTPS_Msk             (0x01UL << HRPWM0_CSG2_SWC_CSTPS_Pos)                   /*!< HRPWM0_CSG2 SWC: CSTPS Mask             */
#define HRPWM0_CSG2_SWC_CSTD_Pos              5                                                       /*!< HRPWM0_CSG2 SWC: CSTD Position          */
#define HRPWM0_CSG2_SWC_CSTD_Msk              (0x01UL << HRPWM0_CSG2_SWC_CSTD_Pos)                    /*!< HRPWM0_CSG2 SWC: CSTD Mask              */
#define HRPWM0_CSG2_SWC_CCRS_Pos              6                                                       /*!< HRPWM0_CSG2 SWC: CCRS Position          */
#define HRPWM0_CSG2_SWC_CCRS_Msk              (0x01UL << HRPWM0_CSG2_SWC_CCRS_Pos)                    /*!< HRPWM0_CSG2 SWC: CCRS Mask              */
#define HRPWM0_CSG2_SWC_CCFS_Pos              7                                                       /*!< HRPWM0_CSG2 SWC: CCFS Position          */
#define HRPWM0_CSG2_SWC_CCFS_Msk              (0x01UL << HRPWM0_CSG2_SWC_CCFS_Pos)                    /*!< HRPWM0_CSG2 SWC: CCFS Mask              */
#define HRPWM0_CSG2_SWC_CCSS_Pos              8                                                       /*!< HRPWM0_CSG2 SWC: CCSS Position          */
#define HRPWM0_CSG2_SWC_CCSS_Msk              (0x01UL << HRPWM0_CSG2_SWC_CCSS_Pos)                    /*!< HRPWM0_CSG2 SWC: CCSS Mask              */

