FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4200.h
/* --------------------------------  HRPWM0_HRC_PL  ------------------------------- */
#define HRPWM0_HRC_PL_PSL0_Pos                0                                                       /*!< HRPWM0_HRC PL: PSL0 Position            */
#define HRPWM0_HRC_PL_PSL0_Msk                (0x01UL << HRPWM0_HRC_PL_PSL0_Pos)                      /*!< HRPWM0_HRC PL: PSL0 Mask                */
#define HRPWM0_HRC_PL_PSL1_Pos                1                                                       /*!< HRPWM0_HRC PL: PSL1 Position            */
#define HRPWM0_HRC_PL_PSL1_Msk                (0x01UL << HRPWM0_HRC_PL_PSL1_Pos)                      /*!< HRPWM0_HRC PL: PSL1 Mask                */

/* -------------------------------  HRPWM0_HRC_GSEL  ------------------------------ */
#define HRPWM0_HRC_GSEL_C0SS_Pos              0                                                       /*!< HRPWM0_HRC GSEL: C0SS Position          */
#define HRPWM0_HRC_GSEL_C0SS_Msk              (0x07UL << HRPWM0_HRC_GSEL_C0SS_Pos)                    /*!< HRPWM0_HRC GSEL: C0SS Mask              */
#define HRPWM0_HRC_GSEL_C0CS_Pos              3                                                       /*!< HRPWM0_HRC GSEL: C0CS Position          */
#define HRPWM0_HRC_GSEL_C0CS_Msk              (0x07UL << HRPWM0_HRC_GSEL_C0CS_Pos)                    /*!< HRPWM0_HRC GSEL: C0CS Mask              */
#define HRPWM0_HRC_GSEL_S0M_Pos               6                                                       /*!< HRPWM0_HRC GSEL: S0M Position           */
#define HRPWM0_HRC_GSEL_S0M_Msk               (0x03UL << HRPWM0_HRC_GSEL_S0M_Pos)                     /*!< HRPWM0_HRC GSEL: S0M Mask               */
#define HRPWM0_HRC_GSEL_C0M_Pos               8                                                       /*!< HRPWM0_HRC GSEL: C0M Position           */
#define HRPWM0_HRC_GSEL_C0M_Msk               (0x03UL << HRPWM0_HRC_GSEL_C0M_Pos)                     /*!< HRPWM0_HRC GSEL: C0M Mask               */
#define HRPWM0_HRC_GSEL_S0ES_Pos              10                                                      /*!< HRPWM0_HRC GSEL: S0ES Position          */
#define HRPWM0_HRC_GSEL_S0ES_Msk              (0x03UL << HRPWM0_HRC_GSEL_S0ES_Pos)                    /*!< HRPWM0_HRC GSEL: S0ES Mask              */
#define HRPWM0_HRC_GSEL_C0ES_Pos              12                                                      /*!< HRPWM0_HRC GSEL: C0ES Position          */
#define HRPWM0_HRC_GSEL_C0ES_Msk              (0x03UL << HRPWM0_HRC_GSEL_C0ES_Pos)                    /*!< HRPWM0_HRC GSEL: C0ES Mask              */
#define HRPWM0_HRC_GSEL_C1SS_Pos              16                                                      /*!< HRPWM0_HRC GSEL: C1SS Position          */
#define HRPWM0_HRC_GSEL_C1SS_Msk              (0x07UL << HRPWM0_HRC_GSEL_C1SS_Pos)                    /*!< HRPWM0_HRC GSEL: C1SS Mask              */
#define HRPWM0_HRC_GSEL_C1CS_Pos              19                                                      /*!< HRPWM0_HRC GSEL: C1CS Position          */
#define HRPWM0_HRC_GSEL_C1CS_Msk              (0x07UL << HRPWM0_HRC_GSEL_C1CS_Pos)                    /*!< HRPWM0_HRC GSEL: C1CS Mask              */
#define HRPWM0_HRC_GSEL_S1M_Pos               22                                                      /*!< HRPWM0_HRC GSEL: S1M Position           */
#define HRPWM0_HRC_GSEL_S1M_Msk               (0x03UL << HRPWM0_HRC_GSEL_S1M_Pos)                     /*!< HRPWM0_HRC GSEL: S1M Mask               */
#define HRPWM0_HRC_GSEL_C1M_Pos               24                                                      /*!< HRPWM0_HRC GSEL: C1M Position           */
#define HRPWM0_HRC_GSEL_C1M_Msk               (0x03UL << HRPWM0_HRC_GSEL_C1M_Pos)                     /*!< HRPWM0_HRC GSEL: C1M Mask               */
#define HRPWM0_HRC_GSEL_S1ES_Pos              26                                                      /*!< HRPWM0_HRC GSEL: S1ES Position          */
#define HRPWM0_HRC_GSEL_S1ES_Msk              (0x03UL << HRPWM0_HRC_GSEL_S1ES_Pos)                    /*!< HRPWM0_HRC GSEL: S1ES Mask              */
#define HRPWM0_HRC_GSEL_C1ES_Pos              28                                                      /*!< HRPWM0_HRC GSEL: C1ES Position          */
#define HRPWM0_HRC_GSEL_C1ES_Msk              (0x03UL << HRPWM0_HRC_GSEL_C1ES_Pos)                    /*!< HRPWM0_HRC GSEL: C1ES Mask              */

/* -------------------------------  HRPWM0_HRC_TSEL  ------------------------------ */
#define HRPWM0_HRC_TSEL_TSEL0_Pos             0                                                       /*!< HRPWM0_HRC TSEL: TSEL0 Position         */
#define HRPWM0_HRC_TSEL_TSEL0_Msk             (0x07UL << HRPWM0_HRC_TSEL_TSEL0_Pos)                   /*!< HRPWM0_HRC TSEL: TSEL0 Mask             */
#define HRPWM0_HRC_TSEL_TSEL1_Pos             3                                                       /*!< HRPWM0_HRC TSEL: TSEL1 Position         */
#define HRPWM0_HRC_TSEL_TSEL1_Msk             (0x07UL << HRPWM0_HRC_TSEL_TSEL1_Pos)                   /*!< HRPWM0_HRC TSEL: TSEL1 Mask             */
#define HRPWM0_HRC_TSEL_TS0E_Pos              16                                                      /*!< HRPWM0_HRC TSEL: TS0E Position          */
#define HRPWM0_HRC_TSEL_TS0E_Msk              (0x01UL << HRPWM0_HRC_TSEL_TS0E_Pos)                    /*!< HRPWM0_HRC TSEL: TS0E Mask              */
#define HRPWM0_HRC_TSEL_TS1E_Pos              17                                                      /*!< HRPWM0_HRC TSEL: TS1E Position          */
#define HRPWM0_HRC_TSEL_TS1E_Msk              (0x01UL << HRPWM0_HRC_TSEL_TS1E_Pos)                    /*!< HRPWM0_HRC TSEL: TS1E Mask              */

/* --------------------------------  HRPWM0_HRC_SC  ------------------------------- */
#define HRPWM0_HRC_SC_ST_Pos                  0                                                       /*!< HRPWM0_HRC SC: ST Position              */
#define HRPWM0_HRC_SC_ST_Msk                  (0x01UL << HRPWM0_HRC_SC_ST_Pos)                        /*!< HRPWM0_HRC SC: ST Mask                  */

/* -------------------------------  HRPWM0_HRC_DCR  ------------------------------- */
#define HRPWM0_HRC_DCR_DTRV_Pos               0                                                       /*!< HRPWM0_HRC DCR: DTRV Position           */
#define HRPWM0_HRC_DCR_DTRV_Msk               (0x0000ffffUL << HRPWM0_HRC_DCR_DTRV_Pos)               /*!< HRPWM0_HRC DCR: DTRV Mask               */

