FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4200.h
/* ------------------------------  HRPWM0_HRC2_TSEL  ------------------------------ */
#define HRPWM0_HRC2_TSEL_TSEL0_Pos            0                                                       /*!< HRPWM0_HRC2 TSEL: TSEL0 Position        */
#define HRPWM0_HRC2_TSEL_TSEL0_Msk            (0x07UL << HRPWM0_HRC2_TSEL_TSEL0_Pos)                  /*!< HRPWM0_HRC2 TSEL: TSEL0 Mask            */
#define HRPWM0_HRC2_TSEL_TSEL1_Pos            3                                                       /*!< HRPWM0_HRC2 TSEL: TSEL1 Position        */
#define HRPWM0_HRC2_TSEL_TSEL1_Msk            (0x07UL << HRPWM0_HRC2_TSEL_TSEL1_Pos)                  /*!< HRPWM0_HRC2 TSEL: TSEL1 Mask            */
#define HRPWM0_HRC2_TSEL_TS0E_Pos             16                                                      /*!< HRPWM0_HRC2 TSEL: TS0E Position         */
#define HRPWM0_HRC2_TSEL_TS0E_Msk             (0x01UL << HRPWM0_HRC2_TSEL_TS0E_Pos)                   /*!< HRPWM0_HRC2 TSEL: TS0E Mask             */
#define HRPWM0_HRC2_TSEL_TS1E_Pos             17                                                      /*!< HRPWM0_HRC2 TSEL: TS1E Position         */
#define HRPWM0_HRC2_TSEL_TS1E_Msk             (0x01UL << HRPWM0_HRC2_TSEL_TS1E_Pos)                   /*!< HRPWM0_HRC2 TSEL: TS1E Mask             */

/* -------------------------------  HRPWM0_HRC2_SC  ------------------------------- */
#define HRPWM0_HRC2_SC_ST_Pos                 0                                                       /*!< HRPWM0_HRC2 SC: ST Position             */
#define HRPWM0_HRC2_SC_ST_Msk                 (0x01UL << HRPWM0_HRC2_SC_ST_Pos)                       /*!< HRPWM0_HRC2 SC: ST Mask                 */

/* -------------------------------  HRPWM0_HRC2_DCR  ------------------------------ */
#define HRPWM0_HRC2_DCR_DTRV_Pos              0                                                       /*!< HRPWM0_HRC2 DCR: DTRV Position          */
#define HRPWM0_HRC2_DCR_DTRV_Msk              (0x0000ffffUL << HRPWM0_HRC2_DCR_DTRV_Pos)              /*!< HRPWM0_HRC2 DCR: DTRV Mask              */

/* -------------------------------  HRPWM0_HRC2_DCF  ------------------------------ */
#define HRPWM0_HRC2_DCF_DTFV_Pos              0                                                       /*!< HRPWM0_HRC2 DCF: DTFV Position          */
#define HRPWM0_HRC2_DCF_DTFV_Msk              (0x0000ffffUL << HRPWM0_HRC2_DCF_DTFV_Pos)              /*!< HRPWM0_HRC2 DCF: DTFV Mask              */

/* -------------------------------  HRPWM0_HRC2_CR1  ------------------------------ */
#define HRPWM0_HRC2_CR1_CR1_Pos               0                                                       /*!< HRPWM0_HRC2 CR1: CR1 Position           */
#define HRPWM0_HRC2_CR1_CR1_Msk               (0x000000ffUL << HRPWM0_HRC2_CR1_CR1_Pos)               /*!< HRPWM0_HRC2 CR1: CR1 Mask               */

/* -------------------------------  HRPWM0_HRC2_CR2  ------------------------------ */
#define HRPWM0_HRC2_CR2_CR2_Pos               0                                                       /*!< HRPWM0_HRC2 CR2: CR2 Position           */
#define HRPWM0_HRC2_CR2_CR2_Msk               (0x000000ffUL << HRPWM0_HRC2_CR2_CR2_Pos)               /*!< HRPWM0_HRC2 CR2: CR2 Mask               */

/* -------------------------------  HRPWM0_HRC2_SSC  ------------------------------ */
#define HRPWM0_HRC2_SSC_SST_Pos               0                                                       /*!< HRPWM0_HRC2 SSC: SST Position           */
#define HRPWM0_HRC2_SSC_SST_Msk               (0x01UL << HRPWM0_HRC2_SSC_SST_Pos)                     /*!< HRPWM0_HRC2 SSC: SST Mask               */

/* ------------------------------  HRPWM0_HRC2_SDCR  ------------------------------ */
#define HRPWM0_HRC2_SDCR_SDTRV_Pos            0                                                       /*!< HRPWM0_HRC2 SDCR: SDTRV Position        */
#define HRPWM0_HRC2_SDCR_SDTRV_Msk            (0x0000ffffUL << HRPWM0_HRC2_SDCR_SDTRV_Pos)            /*!< HRPWM0_HRC2 SDCR: SDTRV Mask            */

/* ------------------------------  HRPWM0_HRC2_SDCF  ------------------------------ */
#define HRPWM0_HRC2_SDCF_SDTFV_Pos            0                                                       /*!< HRPWM0_HRC2 SDCF: SDTFV Position        */
#define HRPWM0_HRC2_SDCF_SDTFV_Msk            (0x0000ffffUL << HRPWM0_HRC2_SDCF_SDTFV_Pos)            /*!< HRPWM0_HRC2 SDCF: SDTFV Mask            */

/* ------------------------------  HRPWM0_HRC2_SCR1  ------------------------------ */
#define HRPWM0_HRC2_SCR1_SCR1_Pos             0                                                       /*!< HRPWM0_HRC2 SCR1: SCR1 Position         */
#define HRPWM0_HRC2_SCR1_SCR1_Msk             (0x000000ffUL << HRPWM0_HRC2_SCR1_SCR1_Pos)             /*!< HRPWM0_HRC2 SCR1: SCR1 Mask             */

/* ------------------------------  HRPWM0_HRC2_SCR2  ------------------------------ */
#define HRPWM0_HRC2_SCR2_SCR2_Pos             0                                                       /*!< HRPWM0_HRC2 SCR2: SCR2 Position         */
#define HRPWM0_HRC2_SCR2_SCR2_Msk             (0x000000ffUL << HRPWM0_HRC2_SCR2_SCR2_Pos)             /*!< HRPWM0_HRC2 SCR2: SCR2 Mask             */


/* ================================================================================ */
/* ================      struct 'HRPWM0_HRC3' Position & Mask      ================ */
/* ================================================================================ */


/* -------------------------------  HRPWM0_HRC3_GC  ------------------------------- */
#define HRPWM0_HRC3_GC_HRM0_Pos               0                                                       /*!< HRPWM0_HRC3 GC: HRM0 Position           */
#define HRPWM0_HRC3_GC_HRM0_Msk               (0x03UL << HRPWM0_HRC3_GC_HRM0_Pos)                     /*!< HRPWM0_HRC3 GC: HRM0 Mask               */
#define HRPWM0_HRC3_GC_HRM1_Pos               2                                                       /*!< HRPWM0_HRC3 GC: HRM1 Position           */
#define HRPWM0_HRC3_GC_HRM1_Msk               (0x03UL << HRPWM0_HRC3_GC_HRM1_Pos)                     /*!< HRPWM0_HRC3 GC: HRM1 Mask               */
#define HRPWM0_HRC3_GC_DTE_Pos                8                                                       /*!< HRPWM0_HRC3 GC: DTE Position            */
#define HRPWM0_HRC3_GC_DTE_Msk                (0x01UL << HRPWM0_HRC3_GC_DTE_Pos)                      /*!< HRPWM0_HRC3 GC: DTE Mask                */
#define HRPWM0_HRC3_GC_TR0E_Pos               9                                                       /*!< HRPWM0_HRC3 GC: TR0E Position           */
#define HRPWM0_HRC3_GC_TR0E_Msk               (0x01UL << HRPWM0_HRC3_GC_TR0E_Pos)                     /*!< HRPWM0_HRC3 GC: TR0E Mask               */
#define HRPWM0_HRC3_GC_TR1E_Pos               10                                                      /*!< HRPWM0_HRC3 GC: TR1E Position           */
#define HRPWM0_HRC3_GC_TR1E_Msk               (0x01UL << HRPWM0_HRC3_GC_TR1E_Pos)                     /*!< HRPWM0_HRC3 GC: TR1E Mask               */
#define HRPWM0_HRC3_GC_STC_Pos                11                                                      /*!< HRPWM0_HRC3 GC: STC Position            */
#define HRPWM0_HRC3_GC_STC_Msk                (0x01UL << HRPWM0_HRC3_GC_STC_Pos)                      /*!< HRPWM0_HRC3 GC: STC Mask                */
#define HRPWM0_HRC3_GC_DSTC_Pos               12                                                      /*!< HRPWM0_HRC3 GC: DSTC Position           */
#define HRPWM0_HRC3_GC_DSTC_Msk               (0x01UL << HRPWM0_HRC3_GC_DSTC_Pos)                     /*!< HRPWM0_HRC3 GC: DSTC Mask               */
#define HRPWM0_HRC3_GC_OCS0_Pos               13                                                      /*!< HRPWM0_HRC3 GC: OCS0 Position           */
#define HRPWM0_HRC3_GC_OCS0_Msk               (0x01UL << HRPWM0_HRC3_GC_OCS0_Pos)                     /*!< HRPWM0_HRC3 GC: OCS0 Mask               */
#define HRPWM0_HRC3_GC_OCS1_Pos               14                                                      /*!< HRPWM0_HRC3 GC: OCS1 Position           */
#define HRPWM0_HRC3_GC_OCS1_Msk               (0x01UL << HRPWM0_HRC3_GC_OCS1_Pos)                     /*!< HRPWM0_HRC3 GC: OCS1 Mask               */
#define HRPWM0_HRC3_GC_DTUS_Pos               16                                                      /*!< HRPWM0_HRC3 GC: DTUS Position           */
#define HRPWM0_HRC3_GC_DTUS_Msk               (0x01UL << HRPWM0_HRC3_GC_DTUS_Pos)                     /*!< HRPWM0_HRC3 GC: DTUS Mask               */

/* -------------------------------  HRPWM0_HRC3_PL  ------------------------------- */
#define HRPWM0_HRC3_PL_PSL0_Pos               0                                                       /*!< HRPWM0_HRC3 PL: PSL0 Position           */
#define HRPWM0_HRC3_PL_PSL0_Msk               (0x01UL << HRPWM0_HRC3_PL_PSL0_Pos)                     /*!< HRPWM0_HRC3 PL: PSL0 Mask               */
#define HRPWM0_HRC3_PL_PSL1_Pos               1                                                       /*!< HRPWM0_HRC3 PL: PSL1 Position           */
#define HRPWM0_HRC3_PL_PSL1_Msk               (0x01UL << HRPWM0_HRC3_PL_PSL1_Pos)                     /*!< HRPWM0_HRC3 PL: PSL1 Mask               */

