FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4200.h
/* ----------------------------------  PORT1_IN  ---------------------------------- */
#define PORT1_IN_P0_Pos                       0                                                       /*!< PORT1 IN: P0 Position                   */
#define PORT1_IN_P0_Msk                       (0x01UL << PORT1_IN_P0_Pos)                             /*!< PORT1 IN: P0 Mask                       */
#define PORT1_IN_P1_Pos                       1                                                       /*!< PORT1 IN: P1 Position                   */
#define PORT1_IN_P1_Msk                       (0x01UL << PORT1_IN_P1_Pos)                             /*!< PORT1 IN: P1 Mask                       */
#define PORT1_IN_P2_Pos                       2                                                       /*!< PORT1 IN: P2 Position                   */
#define PORT1_IN_P2_Msk                       (0x01UL << PORT1_IN_P2_Pos)                             /*!< PORT1 IN: P2 Mask                       */
#define PORT1_IN_P3_Pos                       3                                                       /*!< PORT1 IN: P3 Position                   */
#define PORT1_IN_P3_Msk                       (0x01UL << PORT1_IN_P3_Pos)                             /*!< PORT1 IN: P3 Mask                       */
#define PORT1_IN_P4_Pos                       4                                                       /*!< PORT1 IN: P4 Position                   */
#define PORT1_IN_P4_Msk                       (0x01UL << PORT1_IN_P4_Pos)                             /*!< PORT1 IN: P4 Mask                       */
#define PORT1_IN_P5_Pos                       5                                                       /*!< PORT1 IN: P5 Position                   */
#define PORT1_IN_P5_Msk                       (0x01UL << PORT1_IN_P5_Pos)                             /*!< PORT1 IN: P5 Mask                       */
#define PORT1_IN_P6_Pos                       6                                                       /*!< PORT1 IN: P6 Position                   */
#define PORT1_IN_P6_Msk                       (0x01UL << PORT1_IN_P6_Pos)                             /*!< PORT1 IN: P6 Mask                       */
#define PORT1_IN_P7_Pos                       7                                                       /*!< PORT1 IN: P7 Position                   */
#define PORT1_IN_P7_Msk                       (0x01UL << PORT1_IN_P7_Pos)                             /*!< PORT1 IN: P7 Mask                       */
#define PORT1_IN_P8_Pos                       8                                                       /*!< PORT1 IN: P8 Position                   */
#define PORT1_IN_P8_Msk                       (0x01UL << PORT1_IN_P8_Pos)                             /*!< PORT1 IN: P8 Mask                       */
#define PORT1_IN_P9_Pos                       9                                                       /*!< PORT1 IN: P9 Position                   */
#define PORT1_IN_P9_Msk                       (0x01UL << PORT1_IN_P9_Pos)                             /*!< PORT1 IN: P9 Mask                       */
#define PORT1_IN_P10_Pos                      10                                                      /*!< PORT1 IN: P10 Position                  */
#define PORT1_IN_P10_Msk                      (0x01UL << PORT1_IN_P10_Pos)                            /*!< PORT1 IN: P10 Mask                      */
#define PORT1_IN_P11_Pos                      11                                                      /*!< PORT1 IN: P11 Position                  */
#define PORT1_IN_P11_Msk                      (0x01UL << PORT1_IN_P11_Pos)                            /*!< PORT1 IN: P11 Mask                      */
#define PORT1_IN_P12_Pos                      12                                                      /*!< PORT1 IN: P12 Position                  */
#define PORT1_IN_P12_Msk                      (0x01UL << PORT1_IN_P12_Pos)                            /*!< PORT1 IN: P12 Mask                      */
#define PORT1_IN_P13_Pos                      13                                                      /*!< PORT1 IN: P13 Position                  */
#define PORT1_IN_P13_Msk                      (0x01UL << PORT1_IN_P13_Pos)                            /*!< PORT1 IN: P13 Mask                      */
#define PORT1_IN_P14_Pos                      14                                                      /*!< PORT1 IN: P14 Position                  */
#define PORT1_IN_P14_Msk                      (0x01UL << PORT1_IN_P14_Pos)                            /*!< PORT1 IN: P14 Mask                      */
#define PORT1_IN_P15_Pos                      15                                                      /*!< PORT1 IN: P15 Position                  */
#define PORT1_IN_P15_Msk                      (0x01UL << PORT1_IN_P15_Pos)                            /*!< PORT1 IN: P15 Mask                      */

/* ---------------------------------  PORT1_PDR0  --------------------------------- */
#define PORT1_PDR0_PD0_Pos                    0                                                       /*!< PORT1 PDR0: PD0 Position                */
#define PORT1_PDR0_PD0_Msk                    (0x07UL << PORT1_PDR0_PD0_Pos)                          /*!< PORT1 PDR0: PD0 Mask                    */
#define PORT1_PDR0_PD1_Pos                    4                                                       /*!< PORT1 PDR0: PD1 Position                */
#define PORT1_PDR0_PD1_Msk                    (0x07UL << PORT1_PDR0_PD1_Pos)                          /*!< PORT1 PDR0: PD1 Mask                    */
#define PORT1_PDR0_PD2_Pos                    8                                                       /*!< PORT1 PDR0: PD2 Position                */
#define PORT1_PDR0_PD2_Msk                    (0x07UL << PORT1_PDR0_PD2_Pos)                          /*!< PORT1 PDR0: PD2 Mask                    */
#define PORT1_PDR0_PD3_Pos                    12                                                      /*!< PORT1 PDR0: PD3 Position                */
#define PORT1_PDR0_PD3_Msk                    (0x07UL << PORT1_PDR0_PD3_Pos)                          /*!< PORT1 PDR0: PD3 Mask                    */
#define PORT1_PDR0_PD4_Pos                    16                                                      /*!< PORT1 PDR0: PD4 Position                */
#define PORT1_PDR0_PD4_Msk                    (0x07UL << PORT1_PDR0_PD4_Pos)                          /*!< PORT1 PDR0: PD4 Mask                    */
#define PORT1_PDR0_PD5_Pos                    20                                                      /*!< PORT1 PDR0: PD5 Position                */
#define PORT1_PDR0_PD5_Msk                    (0x07UL << PORT1_PDR0_PD5_Pos)                          /*!< PORT1 PDR0: PD5 Mask                    */
#define PORT1_PDR0_PD6_Pos                    24                                                      /*!< PORT1 PDR0: PD6 Position                */
#define PORT1_PDR0_PD6_Msk                    (0x07UL << PORT1_PDR0_PD6_Pos)                          /*!< PORT1 PDR0: PD6 Mask                    */
#define PORT1_PDR0_PD7_Pos                    28                                                      /*!< PORT1 PDR0: PD7 Position                */
#define PORT1_PDR0_PD7_Msk                    (0x07UL << PORT1_PDR0_PD7_Pos)                          /*!< PORT1 PDR0: PD7 Mask                    */

/* ---------------------------------  PORT1_PDR1  --------------------------------- */
#define PORT1_PDR1_PD8_Pos                    0                                                       /*!< PORT1 PDR1: PD8 Position                */
#define PORT1_PDR1_PD8_Msk                    (0x07UL << PORT1_PDR1_PD8_Pos)                          /*!< PORT1 PDR1: PD8 Mask                    */
#define PORT1_PDR1_PD9_Pos                    4                                                       /*!< PORT1 PDR1: PD9 Position                */
#define PORT1_PDR1_PD9_Msk                    (0x07UL << PORT1_PDR1_PD9_Pos)                          /*!< PORT1 PDR1: PD9 Mask                    */
#define PORT1_PDR1_PD10_Pos                   8                                                       /*!< PORT1 PDR1: PD10 Position               */
#define PORT1_PDR1_PD10_Msk                   (0x07UL << PORT1_PDR1_PD10_Pos)                         /*!< PORT1 PDR1: PD10 Mask                   */
#define PORT1_PDR1_PD11_Pos                   12                                                      /*!< PORT1 PDR1: PD11 Position               */
#define PORT1_PDR1_PD11_Msk                   (0x07UL << PORT1_PDR1_PD11_Pos)                         /*!< PORT1 PDR1: PD11 Mask                   */
#define PORT1_PDR1_PD12_Pos                   16                                                      /*!< PORT1 PDR1: PD12 Position               */
#define PORT1_PDR1_PD12_Msk                   (0x07UL << PORT1_PDR1_PD12_Pos)                         /*!< PORT1 PDR1: PD12 Mask                   */
#define PORT1_PDR1_PD13_Pos                   20                                                      /*!< PORT1 PDR1: PD13 Position               */
#define PORT1_PDR1_PD13_Msk                   (0x07UL << PORT1_PDR1_PD13_Pos)                         /*!< PORT1 PDR1: PD13 Mask                   */
#define PORT1_PDR1_PD14_Pos                   24                                                      /*!< PORT1 PDR1: PD14 Position               */
#define PORT1_PDR1_PD14_Msk                   (0x07UL << PORT1_PDR1_PD14_Pos)                         /*!< PORT1 PDR1: PD14 Mask                   */
#define PORT1_PDR1_PD15_Pos                   28                                                      /*!< PORT1 PDR1: PD15 Position               */
#define PORT1_PDR1_PD15_Msk                   (0x07UL << PORT1_PDR1_PD15_Pos)                         /*!< PORT1 PDR1: PD15 Mask                   */

/* ---------------------------------  PORT1_PDISC  -------------------------------- */
#define PORT1_PDISC_PDIS0_Pos                 0                                                       /*!< PORT1 PDISC: PDIS0 Position             */
#define PORT1_PDISC_PDIS0_Msk                 (0x01UL << PORT1_PDISC_PDIS0_Pos)                       /*!< PORT1 PDISC: PDIS0 Mask                 */
#define PORT1_PDISC_PDIS1_Pos                 1                                                       /*!< PORT1 PDISC: PDIS1 Position             */
#define PORT1_PDISC_PDIS1_Msk                 (0x01UL << PORT1_PDISC_PDIS1_Pos)                       /*!< PORT1 PDISC: PDIS1 Mask                 */
#define PORT1_PDISC_PDIS2_Pos                 2                                                       /*!< PORT1 PDISC: PDIS2 Position             */
#define PORT1_PDISC_PDIS2_Msk                 (0x01UL << PORT1_PDISC_PDIS2_Pos)                       /*!< PORT1 PDISC: PDIS2 Mask                 */
#define PORT1_PDISC_PDIS3_Pos                 3                                                       /*!< PORT1 PDISC: PDIS3 Position             */
#define PORT1_PDISC_PDIS3_Msk                 (0x01UL << PORT1_PDISC_PDIS3_Pos)                       /*!< PORT1 PDISC: PDIS3 Mask                 */
#define PORT1_PDISC_PDIS4_Pos                 4                                                       /*!< PORT1 PDISC: PDIS4 Position             */
#define PORT1_PDISC_PDIS4_Msk                 (0x01UL << PORT1_PDISC_PDIS4_Pos)                       /*!< PORT1 PDISC: PDIS4 Mask                 */
#define PORT1_PDISC_PDIS5_Pos                 5                                                       /*!< PORT1 PDISC: PDIS5 Position             */
#define PORT1_PDISC_PDIS5_Msk                 (0x01UL << PORT1_PDISC_PDIS5_Pos)                       /*!< PORT1 PDISC: PDIS5 Mask                 */
#define PORT1_PDISC_PDIS6_Pos                 6                                                       /*!< PORT1 PDISC: PDIS6 Position             */
#define PORT1_PDISC_PDIS6_Msk                 (0x01UL << PORT1_PDISC_PDIS6_Pos)                       /*!< PORT1 PDISC: PDIS6 Mask                 */
#define PORT1_PDISC_PDIS7_Pos                 7                                                       /*!< PORT1 PDISC: PDIS7 Position             */
#define PORT1_PDISC_PDIS7_Msk                 (0x01UL << PORT1_PDISC_PDIS7_Pos)                       /*!< PORT1 PDISC: PDIS7 Mask                 */
#define PORT1_PDISC_PDIS8_Pos                 8                                                       /*!< PORT1 PDISC: PDIS8 Position             */
#define PORT1_PDISC_PDIS8_Msk                 (0x01UL << PORT1_PDISC_PDIS8_Pos)                       /*!< PORT1 PDISC: PDIS8 Mask                 */
#define PORT1_PDISC_PDIS9_Pos                 9                                                       /*!< PORT1 PDISC: PDIS9 Position             */
#define PORT1_PDISC_PDIS9_Msk                 (0x01UL << PORT1_PDISC_PDIS9_Pos)                       /*!< PORT1 PDISC: PDIS9 Mask                 */
#define PORT1_PDISC_PDIS10_Pos                10                                                      /*!< PORT1 PDISC: PDIS10 Position            */
#define PORT1_PDISC_PDIS10_Msk                (0x01UL << PORT1_PDISC_PDIS10_Pos)                      /*!< PORT1 PDISC: PDIS10 Mask                */
#define PORT1_PDISC_PDIS11_Pos                11                                                      /*!< PORT1 PDISC: PDIS11 Position            */
#define PORT1_PDISC_PDIS11_Msk                (0x01UL << PORT1_PDISC_PDIS11_Pos)                      /*!< PORT1 PDISC: PDIS11 Mask                */
#define PORT1_PDISC_PDIS12_Pos                12                                                      /*!< PORT1 PDISC: PDIS12 Position            */
#define PORT1_PDISC_PDIS12_Msk                (0x01UL << PORT1_PDISC_PDIS12_Pos)                      /*!< PORT1 PDISC: PDIS12 Mask                */
#define PORT1_PDISC_PDIS13_Pos                13                                                      /*!< PORT1 PDISC: PDIS13 Position            */
#define PORT1_PDISC_PDIS13_Msk                (0x01UL << PORT1_PDISC_PDIS13_Pos)                      /*!< PORT1 PDISC: PDIS13 Mask                */
#define PORT1_PDISC_PDIS14_Pos                14                                                      /*!< PORT1 PDISC: PDIS14 Position            */
#define PORT1_PDISC_PDIS14_Msk                (0x01UL << PORT1_PDISC_PDIS14_Pos)                      /*!< PORT1 PDISC: PDIS14 Mask                */
#define PORT1_PDISC_PDIS15_Pos                15                                                      /*!< PORT1 PDISC: PDIS15 Position            */
#define PORT1_PDISC_PDIS15_Msk                (0x01UL << PORT1_PDISC_PDIS15_Pos)                      /*!< PORT1 PDISC: PDIS15 Mask                */

/* ----------------------------------  PORT1_PPS  --------------------------------- */
#define PORT1_PPS_PPS0_Pos                    0                                                       /*!< PORT1 PPS: PPS0 Position                */
#define PORT1_PPS_PPS0_Msk                    (0x01UL << PORT1_PPS_PPS0_Pos)                          /*!< PORT1 PPS: PPS0 Mask                    */
#define PORT1_PPS_PPS1_Pos                    1                                                       /*!< PORT1 PPS: PPS1 Position                */
#define PORT1_PPS_PPS1_Msk                    (0x01UL << PORT1_PPS_PPS1_Pos)                          /*!< PORT1 PPS: PPS1 Mask                    */
#define PORT1_PPS_PPS2_Pos                    2                                                       /*!< PORT1 PPS: PPS2 Position                */
#define PORT1_PPS_PPS2_Msk                    (0x01UL << PORT1_PPS_PPS2_Pos)                          /*!< PORT1 PPS: PPS2 Mask                    */
#define PORT1_PPS_PPS3_Pos                    3                                                       /*!< PORT1 PPS: PPS3 Position                */
#define PORT1_PPS_PPS3_Msk                    (0x01UL << PORT1_PPS_PPS3_Pos)                          /*!< PORT1 PPS: PPS3 Mask                    */
#define PORT1_PPS_PPS4_Pos                    4                                                       /*!< PORT1 PPS: PPS4 Position                */
#define PORT1_PPS_PPS4_Msk                    (0x01UL << PORT1_PPS_PPS4_Pos)                          /*!< PORT1 PPS: PPS4 Mask                    */
#define PORT1_PPS_PPS5_Pos                    5                                                       /*!< PORT1 PPS: PPS5 Position                */
#define PORT1_PPS_PPS5_Msk                    (0x01UL << PORT1_PPS_PPS5_Pos)                          /*!< PORT1 PPS: PPS5 Mask                    */
#define PORT1_PPS_PPS6_Pos                    6                                                       /*!< PORT1 PPS: PPS6 Position                */
#define PORT1_PPS_PPS6_Msk                    (0x01UL << PORT1_PPS_PPS6_Pos)                          /*!< PORT1 PPS: PPS6 Mask                    */
#define PORT1_PPS_PPS7_Pos                    7                                                       /*!< PORT1 PPS: PPS7 Position                */
#define PORT1_PPS_PPS7_Msk                    (0x01UL << PORT1_PPS_PPS7_Pos)                          /*!< PORT1 PPS: PPS7 Mask                    */
#define PORT1_PPS_PPS8_Pos                    8                                                       /*!< PORT1 PPS: PPS8 Position                */
#define PORT1_PPS_PPS8_Msk                    (0x01UL << PORT1_PPS_PPS8_Pos)                          /*!< PORT1 PPS: PPS8 Mask                    */
#define PORT1_PPS_PPS9_Pos                    9                                                       /*!< PORT1 PPS: PPS9 Position                */
#define PORT1_PPS_PPS9_Msk                    (0x01UL << PORT1_PPS_PPS9_Pos)                          /*!< PORT1 PPS: PPS9 Mask                    */
#define PORT1_PPS_PPS10_Pos                   10                                                      /*!< PORT1 PPS: PPS10 Position               */
#define PORT1_PPS_PPS10_Msk                   (0x01UL << PORT1_PPS_PPS10_Pos)                         /*!< PORT1 PPS: PPS10 Mask                   */
#define PORT1_PPS_PPS11_Pos                   11                                                      /*!< PORT1 PPS: PPS11 Position               */
#define PORT1_PPS_PPS11_Msk                   (0x01UL << PORT1_PPS_PPS11_Pos)                         /*!< PORT1 PPS: PPS11 Mask                   */
#define PORT1_PPS_PPS12_Pos                   12                                                      /*!< PORT1 PPS: PPS12 Position               */
#define PORT1_PPS_PPS12_Msk                   (0x01UL << PORT1_PPS_PPS12_Pos)                         /*!< PORT1 PPS: PPS12 Mask                   */
#define PORT1_PPS_PPS13_Pos                   13                                                      /*!< PORT1 PPS: PPS13 Position               */
#define PORT1_PPS_PPS13_Msk                   (0x01UL << PORT1_PPS_PPS13_Pos)                         /*!< PORT1 PPS: PPS13 Mask                   */
#define PORT1_PPS_PPS14_Pos                   14                                                      /*!< PORT1 PPS: PPS14 Position               */
#define PORT1_PPS_PPS14_Msk                   (0x01UL << PORT1_PPS_PPS14_Pos)                         /*!< PORT1 PPS: PPS14 Mask                   */
#define PORT1_PPS_PPS15_Pos                   15                                                      /*!< PORT1 PPS: PPS15 Position               */
#define PORT1_PPS_PPS15_Msk                   (0x01UL << PORT1_PPS_PPS15_Pos)                         /*!< PORT1 PPS: PPS15 Mask                   */

