FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_Infineon_XMC4000_GCC_Dave/System/XMC4200.h
/* ----------------------------------  PORT3_OUT  --------------------------------- */
#define PORT3_OUT_P0_Pos                      0                                                       /*!< PORT3 OUT: P0 Position                  */
#define PORT3_OUT_P0_Msk                      (0x01UL << PORT3_OUT_P0_Pos)                            /*!< PORT3 OUT: P0 Mask                      */
#define PORT3_OUT_P1_Pos                      1                                                       /*!< PORT3 OUT: P1 Position                  */
#define PORT3_OUT_P1_Msk                      (0x01UL << PORT3_OUT_P1_Pos)                            /*!< PORT3 OUT: P1 Mask                      */
#define PORT3_OUT_P2_Pos                      2                                                       /*!< PORT3 OUT: P2 Position                  */
#define PORT3_OUT_P2_Msk                      (0x01UL << PORT3_OUT_P2_Pos)                            /*!< PORT3 OUT: P2 Mask                      */
#define PORT3_OUT_P3_Pos                      3                                                       /*!< PORT3 OUT: P3 Position                  */
#define PORT3_OUT_P3_Msk                      (0x01UL << PORT3_OUT_P3_Pos)                            /*!< PORT3 OUT: P3 Mask                      */
#define PORT3_OUT_P4_Pos                      4                                                       /*!< PORT3 OUT: P4 Position                  */
#define PORT3_OUT_P4_Msk                      (0x01UL << PORT3_OUT_P4_Pos)                            /*!< PORT3 OUT: P4 Mask                      */
#define PORT3_OUT_P5_Pos                      5                                                       /*!< PORT3 OUT: P5 Position                  */
#define PORT3_OUT_P5_Msk                      (0x01UL << PORT3_OUT_P5_Pos)                            /*!< PORT3 OUT: P5 Mask                      */
#define PORT3_OUT_P6_Pos                      6                                                       /*!< PORT3 OUT: P6 Position                  */
#define PORT3_OUT_P6_Msk                      (0x01UL << PORT3_OUT_P6_Pos)                            /*!< PORT3 OUT: P6 Mask                      */
#define PORT3_OUT_P7_Pos                      7                                                       /*!< PORT3 OUT: P7 Position                  */
#define PORT3_OUT_P7_Msk                      (0x01UL << PORT3_OUT_P7_Pos)                            /*!< PORT3 OUT: P7 Mask                      */
#define PORT3_OUT_P8_Pos                      8                                                       /*!< PORT3 OUT: P8 Position                  */
#define PORT3_OUT_P8_Msk                      (0x01UL << PORT3_OUT_P8_Pos)                            /*!< PORT3 OUT: P8 Mask                      */
#define PORT3_OUT_P9_Pos                      9                                                       /*!< PORT3 OUT: P9 Position                  */
#define PORT3_OUT_P9_Msk                      (0x01UL << PORT3_OUT_P9_Pos)                            /*!< PORT3 OUT: P9 Mask                      */
#define PORT3_OUT_P10_Pos                     10                                                      /*!< PORT3 OUT: P10 Position                 */
#define PORT3_OUT_P10_Msk                     (0x01UL << PORT3_OUT_P10_Pos)                           /*!< PORT3 OUT: P10 Mask                     */
#define PORT3_OUT_P11_Pos                     11                                                      /*!< PORT3 OUT: P11 Position                 */
#define PORT3_OUT_P11_Msk                     (0x01UL << PORT3_OUT_P11_Pos)                           /*!< PORT3 OUT: P11 Mask                     */
#define PORT3_OUT_P12_Pos                     12                                                      /*!< PORT3 OUT: P12 Position                 */
#define PORT3_OUT_P12_Msk                     (0x01UL << PORT3_OUT_P12_Pos)                           /*!< PORT3 OUT: P12 Mask                     */
#define PORT3_OUT_P13_Pos                     13                                                      /*!< PORT3 OUT: P13 Position                 */
#define PORT3_OUT_P13_Msk                     (0x01UL << PORT3_OUT_P13_Pos)                           /*!< PORT3 OUT: P13 Mask                     */
#define PORT3_OUT_P14_Pos                     14                                                      /*!< PORT3 OUT: P14 Position                 */
#define PORT3_OUT_P14_Msk                     (0x01UL << PORT3_OUT_P14_Pos)                           /*!< PORT3 OUT: P14 Mask                     */
#define PORT3_OUT_P15_Pos                     15                                                      /*!< PORT3 OUT: P15 Position                 */
#define PORT3_OUT_P15_Msk                     (0x01UL << PORT3_OUT_P15_Pos)                           /*!< PORT3 OUT: P15 Mask                     */

/* ----------------------------------  PORT3_OMR  --------------------------------- */
#define PORT3_OMR_PS0_Pos                     0                                                       /*!< PORT3 OMR: PS0 Position                 */
#define PORT3_OMR_PS0_Msk                     (0x01UL << PORT3_OMR_PS0_Pos)                           /*!< PORT3 OMR: PS0 Mask                     */
#define PORT3_OMR_PS1_Pos                     1                                                       /*!< PORT3 OMR: PS1 Position                 */
#define PORT3_OMR_PS1_Msk                     (0x01UL << PORT3_OMR_PS1_Pos)                           /*!< PORT3 OMR: PS1 Mask                     */
#define PORT3_OMR_PS2_Pos                     2                                                       /*!< PORT3 OMR: PS2 Position                 */
#define PORT3_OMR_PS2_Msk                     (0x01UL << PORT3_OMR_PS2_Pos)                           /*!< PORT3 OMR: PS2 Mask                     */
#define PORT3_OMR_PS3_Pos                     3                                                       /*!< PORT3 OMR: PS3 Position                 */
#define PORT3_OMR_PS3_Msk                     (0x01UL << PORT3_OMR_PS3_Pos)                           /*!< PORT3 OMR: PS3 Mask                     */
#define PORT3_OMR_PS4_Pos                     4                                                       /*!< PORT3 OMR: PS4 Position                 */
#define PORT3_OMR_PS4_Msk                     (0x01UL << PORT3_OMR_PS4_Pos)                           /*!< PORT3 OMR: PS4 Mask                     */
#define PORT3_OMR_PS5_Pos                     5                                                       /*!< PORT3 OMR: PS5 Position                 */
#define PORT3_OMR_PS5_Msk                     (0x01UL << PORT3_OMR_PS5_Pos)                           /*!< PORT3 OMR: PS5 Mask                     */
#define PORT3_OMR_PS6_Pos                     6                                                       /*!< PORT3 OMR: PS6 Position                 */
#define PORT3_OMR_PS6_Msk                     (0x01UL << PORT3_OMR_PS6_Pos)                           /*!< PORT3 OMR: PS6 Mask                     */
#define PORT3_OMR_PS7_Pos                     7                                                       /*!< PORT3 OMR: PS7 Position                 */
#define PORT3_OMR_PS7_Msk                     (0x01UL << PORT3_OMR_PS7_Pos)                           /*!< PORT3 OMR: PS7 Mask                     */
#define PORT3_OMR_PS8_Pos                     8                                                       /*!< PORT3 OMR: PS8 Position                 */
#define PORT3_OMR_PS8_Msk                     (0x01UL << PORT3_OMR_PS8_Pos)                           /*!< PORT3 OMR: PS8 Mask                     */
#define PORT3_OMR_PS9_Pos                     9                                                       /*!< PORT3 OMR: PS9 Position                 */
#define PORT3_OMR_PS9_Msk                     (0x01UL << PORT3_OMR_PS9_Pos)                           /*!< PORT3 OMR: PS9 Mask                     */
#define PORT3_OMR_PS10_Pos                    10                                                      /*!< PORT3 OMR: PS10 Position                */
#define PORT3_OMR_PS10_Msk                    (0x01UL << PORT3_OMR_PS10_Pos)                          /*!< PORT3 OMR: PS10 Mask                    */
#define PORT3_OMR_PS11_Pos                    11                                                      /*!< PORT3 OMR: PS11 Position                */
#define PORT3_OMR_PS11_Msk                    (0x01UL << PORT3_OMR_PS11_Pos)                          /*!< PORT3 OMR: PS11 Mask                    */
#define PORT3_OMR_PS12_Pos                    12                                                      /*!< PORT3 OMR: PS12 Position                */
#define PORT3_OMR_PS12_Msk                    (0x01UL << PORT3_OMR_PS12_Pos)                          /*!< PORT3 OMR: PS12 Mask                    */
#define PORT3_OMR_PS13_Pos                    13                                                      /*!< PORT3 OMR: PS13 Position                */
#define PORT3_OMR_PS13_Msk                    (0x01UL << PORT3_OMR_PS13_Pos)                          /*!< PORT3 OMR: PS13 Mask                    */
#define PORT3_OMR_PS14_Pos                    14                                                      /*!< PORT3 OMR: PS14 Position                */
#define PORT3_OMR_PS14_Msk                    (0x01UL << PORT3_OMR_PS14_Pos)                          /*!< PORT3 OMR: PS14 Mask                    */
#define PORT3_OMR_PS15_Pos                    15                                                      /*!< PORT3 OMR: PS15 Position                */
#define PORT3_OMR_PS15_Msk                    (0x01UL << PORT3_OMR_PS15_Pos)                          /*!< PORT3 OMR: PS15 Mask                    */
#define PORT3_OMR_PR0_Pos                     16                                                      /*!< PORT3 OMR: PR0 Position                 */
#define PORT3_OMR_PR0_Msk                     (0x01UL << PORT3_OMR_PR0_Pos)                           /*!< PORT3 OMR: PR0 Mask                     */
#define PORT3_OMR_PR1_Pos                     17                                                      /*!< PORT3 OMR: PR1 Position                 */
#define PORT3_OMR_PR1_Msk                     (0x01UL << PORT3_OMR_PR1_Pos)                           /*!< PORT3 OMR: PR1 Mask                     */
#define PORT3_OMR_PR2_Pos                     18                                                      /*!< PORT3 OMR: PR2 Position                 */
#define PORT3_OMR_PR2_Msk                     (0x01UL << PORT3_OMR_PR2_Pos)                           /*!< PORT3 OMR: PR2 Mask                     */
#define PORT3_OMR_PR3_Pos                     19                                                      /*!< PORT3 OMR: PR3 Position                 */
#define PORT3_OMR_PR3_Msk                     (0x01UL << PORT3_OMR_PR3_Pos)                           /*!< PORT3 OMR: PR3 Mask                     */
#define PORT3_OMR_PR4_Pos                     20                                                      /*!< PORT3 OMR: PR4 Position                 */
#define PORT3_OMR_PR4_Msk                     (0x01UL << PORT3_OMR_PR4_Pos)                           /*!< PORT3 OMR: PR4 Mask                     */
#define PORT3_OMR_PR5_Pos                     21                                                      /*!< PORT3 OMR: PR5 Position                 */
#define PORT3_OMR_PR5_Msk                     (0x01UL << PORT3_OMR_PR5_Pos)                           /*!< PORT3 OMR: PR5 Mask                     */
#define PORT3_OMR_PR6_Pos                     22                                                      /*!< PORT3 OMR: PR6 Position                 */
#define PORT3_OMR_PR6_Msk                     (0x01UL << PORT3_OMR_PR6_Pos)                           /*!< PORT3 OMR: PR6 Mask                     */
#define PORT3_OMR_PR7_Pos                     23                                                      /*!< PORT3 OMR: PR7 Position                 */
#define PORT3_OMR_PR7_Msk                     (0x01UL << PORT3_OMR_PR7_Pos)                           /*!< PORT3 OMR: PR7 Mask                     */
#define PORT3_OMR_PR8_Pos                     24                                                      /*!< PORT3 OMR: PR8 Position                 */
#define PORT3_OMR_PR8_Msk                     (0x01UL << PORT3_OMR_PR8_Pos)                           /*!< PORT3 OMR: PR8 Mask                     */
#define PORT3_OMR_PR9_Pos                     25                                                      /*!< PORT3 OMR: PR9 Position                 */
#define PORT3_OMR_PR9_Msk                     (0x01UL << PORT3_OMR_PR9_Pos)                           /*!< PORT3 OMR: PR9 Mask                     */
#define PORT3_OMR_PR10_Pos                    26                                                      /*!< PORT3 OMR: PR10 Position                */
#define PORT3_OMR_PR10_Msk                    (0x01UL << PORT3_OMR_PR10_Pos)                          /*!< PORT3 OMR: PR10 Mask                    */
#define PORT3_OMR_PR11_Pos                    27                                                      /*!< PORT3 OMR: PR11 Position                */
#define PORT3_OMR_PR11_Msk                    (0x01UL << PORT3_OMR_PR11_Pos)                          /*!< PORT3 OMR: PR11 Mask                    */
#define PORT3_OMR_PR12_Pos                    28                                                      /*!< PORT3 OMR: PR12 Position                */
#define PORT3_OMR_PR12_Msk                    (0x01UL << PORT3_OMR_PR12_Pos)                          /*!< PORT3 OMR: PR12 Mask                    */
#define PORT3_OMR_PR13_Pos                    29                                                      /*!< PORT3 OMR: PR13 Position                */
#define PORT3_OMR_PR13_Msk                    (0x01UL << PORT3_OMR_PR13_Pos)                          /*!< PORT3 OMR: PR13 Mask                    */
#define PORT3_OMR_PR14_Pos                    30                                                      /*!< PORT3 OMR: PR14 Position                */
#define PORT3_OMR_PR14_Msk                    (0x01UL << PORT3_OMR_PR14_Pos)                          /*!< PORT3 OMR: PR14 Mask                    */
#define PORT3_OMR_PR15_Pos                    31                                                      /*!< PORT3 OMR: PR15 Position                */
#define PORT3_OMR_PR15_Msk                    (0x01UL << PORT3_OMR_PR15_Pos)                          /*!< PORT3 OMR: PR15 Mask                    */

/* ---------------------------------  PORT3_IOCR0  -------------------------------- */
#define PORT3_IOCR0_PC0_Pos                   3                                                       /*!< PORT3 IOCR0: PC0 Position               */
#define PORT3_IOCR0_PC0_Msk                   (0x1fUL << PORT3_IOCR0_PC0_Pos)                         /*!< PORT3 IOCR0: PC0 Mask                   */
#define PORT3_IOCR0_PC1_Pos                   11                                                      /*!< PORT3 IOCR0: PC1 Position               */
#define PORT3_IOCR0_PC1_Msk                   (0x1fUL << PORT3_IOCR0_PC1_Pos)                         /*!< PORT3 IOCR0: PC1 Mask                   */
#define PORT3_IOCR0_PC2_Pos                   19                                                      /*!< PORT3 IOCR0: PC2 Position               */
#define PORT3_IOCR0_PC2_Msk                   (0x1fUL << PORT3_IOCR0_PC2_Pos)                         /*!< PORT3 IOCR0: PC2 Mask                   */
#define PORT3_IOCR0_PC3_Pos                   27                                                      /*!< PORT3 IOCR0: PC3 Position               */
#define PORT3_IOCR0_PC3_Msk                   (0x1fUL << PORT3_IOCR0_PC3_Pos)                         /*!< PORT3 IOCR0: PC3 Mask                   */

/* ----------------------------------  PORT3_IN  ---------------------------------- */
#define PORT3_IN_P0_Pos                       0                                                       /*!< PORT3 IN: P0 Position                   */
#define PORT3_IN_P0_Msk                       (0x01UL << PORT3_IN_P0_Pos)                             /*!< PORT3 IN: P0 Mask                       */
#define PORT3_IN_P1_Pos                       1                                                       /*!< PORT3 IN: P1 Position                   */
#define PORT3_IN_P1_Msk                       (0x01UL << PORT3_IN_P1_Pos)                             /*!< PORT3 IN: P1 Mask                       */
#define PORT3_IN_P2_Pos                       2                                                       /*!< PORT3 IN: P2 Position                   */
#define PORT3_IN_P2_Msk                       (0x01UL << PORT3_IN_P2_Pos)                             /*!< PORT3 IN: P2 Mask                       */
#define PORT3_IN_P3_Pos                       3                                                       /*!< PORT3 IN: P3 Position                   */
#define PORT3_IN_P3_Msk                       (0x01UL << PORT3_IN_P3_Pos)                             /*!< PORT3 IN: P3 Mask                       */
#define PORT3_IN_P4_Pos                       4                                                       /*!< PORT3 IN: P4 Position                   */
#define PORT3_IN_P4_Msk                       (0x01UL << PORT3_IN_P4_Pos)                             /*!< PORT3 IN: P4 Mask                       */
#define PORT3_IN_P5_Pos                       5                                                       /*!< PORT3 IN: P5 Position                   */
#define PORT3_IN_P5_Msk                       (0x01UL << PORT3_IN_P5_Pos)                             /*!< PORT3 IN: P5 Mask                       */
#define PORT3_IN_P6_Pos                       6                                                       /*!< PORT3 IN: P6 Position                   */
#define PORT3_IN_P6_Msk                       (0x01UL << PORT3_IN_P6_Pos)                             /*!< PORT3 IN: P6 Mask                       */
#define PORT3_IN_P7_Pos                       7                                                       /*!< PORT3 IN: P7 Position                   */
#define PORT3_IN_P7_Msk                       (0x01UL << PORT3_IN_P7_Pos)                             /*!< PORT3 IN: P7 Mask                       */
#define PORT3_IN_P8_Pos                       8                                                       /*!< PORT3 IN: P8 Position                   */
#define PORT3_IN_P8_Msk                       (0x01UL << PORT3_IN_P8_Pos)                             /*!< PORT3 IN: P8 Mask                       */
#define PORT3_IN_P9_Pos                       9                                                       /*!< PORT3 IN: P9 Position                   */
#define PORT3_IN_P9_Msk                       (0x01UL << PORT3_IN_P9_Pos)                             /*!< PORT3 IN: P9 Mask                       */
#define PORT3_IN_P10_Pos                      10                                                      /*!< PORT3 IN: P10 Position                  */
#define PORT3_IN_P10_Msk                      (0x01UL << PORT3_IN_P10_Pos)                            /*!< PORT3 IN: P10 Mask                      */
#define PORT3_IN_P11_Pos                      11                                                      /*!< PORT3 IN: P11 Position                  */
#define PORT3_IN_P11_Msk                      (0x01UL << PORT3_IN_P11_Pos)                            /*!< PORT3 IN: P11 Mask                      */
#define PORT3_IN_P12_Pos                      12                                                      /*!< PORT3 IN: P12 Position                  */
#define PORT3_IN_P12_Msk                      (0x01UL << PORT3_IN_P12_Pos)                            /*!< PORT3 IN: P12 Mask                      */
#define PORT3_IN_P13_Pos                      13                                                      /*!< PORT3 IN: P13 Position                  */
#define PORT3_IN_P13_Msk                      (0x01UL << PORT3_IN_P13_Pos)                            /*!< PORT3 IN: P13 Mask                      */
#define PORT3_IN_P14_Pos                      14                                                      /*!< PORT3 IN: P14 Position                  */
#define PORT3_IN_P14_Msk                      (0x01UL << PORT3_IN_P14_Pos)                            /*!< PORT3 IN: P14 Mask                      */
#define PORT3_IN_P15_Pos                      15                                                      /*!< PORT3 IN: P15 Position                  */
#define PORT3_IN_P15_Msk                      (0x01UL << PORT3_IN_P15_Pos)                            /*!< PORT3 IN: P15 Mask                      */

/* ---------------------------------  PORT3_PDR0  --------------------------------- */
#define PORT3_PDR0_PD0_Pos                    0                                                       /*!< PORT3 PDR0: PD0 Position                */
#define PORT3_PDR0_PD0_Msk                    (0x07UL << PORT3_PDR0_PD0_Pos)                          /*!< PORT3 PDR0: PD0 Mask                    */
#define PORT3_PDR0_PD1_Pos                    4                                                       /*!< PORT3 PDR0: PD1 Position                */
#define PORT3_PDR0_PD1_Msk                    (0x07UL << PORT3_PDR0_PD1_Pos)                          /*!< PORT3 PDR0: PD1 Mask                    */
#define PORT3_PDR0_PD2_Pos                    8                                                       /*!< PORT3 PDR0: PD2 Position                */
#define PORT3_PDR0_PD2_Msk                    (0x07UL << PORT3_PDR0_PD2_Pos)                          /*!< PORT3 PDR0: PD2 Mask                    */
#define PORT3_PDR0_PD3_Pos                    12                                                      /*!< PORT3 PDR0: PD3 Position                */
#define PORT3_PDR0_PD3_Msk                    (0x07UL << PORT3_PDR0_PD3_Pos)                          /*!< PORT3 PDR0: PD3 Mask                    */
#define PORT3_PDR0_PD4_Pos                    16                                                      /*!< PORT3 PDR0: PD4 Position                */
#define PORT3_PDR0_PD4_Msk                    (0x07UL << PORT3_PDR0_PD4_Pos)                          /*!< PORT3 PDR0: PD4 Mask                    */
#define PORT3_PDR0_PD5_Pos                    20                                                      /*!< PORT3 PDR0: PD5 Position                */
#define PORT3_PDR0_PD5_Msk                    (0x07UL << PORT3_PDR0_PD5_Pos)                          /*!< PORT3 PDR0: PD5 Mask                    */
#define PORT3_PDR0_PD6_Pos                    24                                                      /*!< PORT3 PDR0: PD6 Position                */
#define PORT3_PDR0_PD6_Msk                    (0x07UL << PORT3_PDR0_PD6_Pos)                          /*!< PORT3 PDR0: PD6 Mask                    */
#define PORT3_PDR0_PD7_Pos                    28                                                      /*!< PORT3 PDR0: PD7 Position                */
#define PORT3_PDR0_PD7_Msk                    (0x07UL << PORT3_PDR0_PD7_Pos)                          /*!< PORT3 PDR0: PD7 Mask                    */

